local zdwqcs_pos = {64124,24,36,6,14142,"快速制作"}		--npc{地图,x,y,方向,造型,名字}

local zdwqcs_zzjg = 100 			--单个制作所需的魔币(不扣除写0)

local zdwqcs_zzsl = 10 	 			--每次最多可以制作的数量

local zdwqcs_zy = {200,6005}			--能制作的职业id范围{最低职业id,最高职业id}

local zdwqcs_jy = {}				--使用该技能时每个增加的技能经验(不增加写0)
zdwqcs_jy[200] = 100;				--zdwqcs_jy[技能编号]=技能经验		
zdwqcs_jy[201] = 100;			
zdwqcs_jy[202] = 100;			
zdwqcs_jy[203] = 100;			
zdwqcs_jy[204] = 100;			
zdwqcs_jy[205] = 100;			
zdwqcs_jy[206] = 100;			
zdwqcs_jy[207] = 100;			
zdwqcs_jy[208] = 100;			
zdwqcs_jy[209] = 100;			
zdwqcs_jy[210] = 100;			
zdwqcs_jy[211] = 100;			
zdwqcs_jy[212] = 100;			
zdwqcs_jy[213] = 100;			
zdwqcs_jy[214] = 100;			
zdwqcs_jy[215] = 100;			
zdwqcs_jy[216] = 100;			

-------------------------------------------------------------
--以下内容非专业人员不建议修改
local zzwpid = {}
zzwpid[1] = {"苹果薄荷",12800,10,"柠檬草",12801,1,"药（100）",15606,1} -----生命力回复药（100）
zzwpid[2] = {"苹果薄荷",12800,10,"柠檬草",12801,1,"药（150）",15607,2} -----生命力回复药（150）
zzwpid[3] = {"苹果薄荷",12800,10,"柠檬草",12801,1,"蝴蝶花",12802,5,"药（200）",15608,3} -----生命力回复药（200）
zzwpid[4] = {"柠檬草",12801,10,"蝴蝶花",12802,15,"果梨",12803,5,"药（250）",15609,4} -----生命力回复药（250）
zzwpid[5] = {"蝴蝶花",12802,15,"果梨",12803,15,"桃木",12804,5,"药（300）",15610,5} -----生命力回复药（300）
zzwpid[6] = {"果梨",12803,10,"桃木",12804,15,"番红花",12805,15,"药（400）",15611,6} -----生命力回复药（400）
zzwpid[7] = {"果梨",12803,5,"桃木",12804,13,"番红花",12805,15,"百里香",12806,15,"药（500）",15612,7} -----生命力回复药（500）
zzwpid[8] = {"苹果薄荷",12800,10,"果梨",12803,10,"番红花",12805,10,"百里香",12806,20,"瞿麦",12807,10,"药（600）",15613,8} -----生命力回复药（600）
zzwpid[9] = {"蝴蝶花",12802,5,"番红花",12805,7,"瞿麦",12807,5,"茴香",12808,10,"七叶草",12809,5,"药（800）",15614,9} -----生命力回复药（800）
zzwpid[10] = {"苹果薄荷",12800,10,"柠檬草",12801,10,"瞿麦",12807,6,"茴香",12808,8,"七叶草",12809,10,"药（1000）",15615,10} -----生命力回复药（1000）

zzwpid[11] = {"番茄",12006,5,"瓶子",18314,1,"蕃茄酱",12405,1} -----蕃茄酱
zzwpid[12] = {"小麦粉",12400,16,"牛奶",12401,10,"盐",12402,5,"面包",15201,1} -----面包
zzwpid[13] = {"鸡蛋",12404,10,"牛奶",12401,15,"盐",12402,5,"蕃茄酱",12405,1,"芹菜",12000,1,"蛋包饭",15202,2} -----蛋包饭
zzwpid[14] = {"小麦粉",12400,20,"牛奶",12401,20,"盐",12402,20,"法国面包",15203,2} -----法国面包
zzwpid[15] = {"小麦粉",12400,20,"盐",12402,10,"海苔",12407,20,"姜",12001,12,"炒面",15204,3} -----炒面
zzwpid[16] = {"青椒",12002,20,"盐",12402,10,"竹笋",12003,20,"牛肉",11200,20,"青椒肉丝",15206,3} -----青椒肉丝
zzwpid[17] = {"柠檬草",12801,20,"盐",12402,20,"鸡肉",11201,20,"胡椒",12408,20,"烧鸡",15207,4} -----烧鸡
zzwpid[18] = {"鸡蛋",12404,20,"葱",12004,20,"酱油",12409,20,"鸡肉",11201,20,"米",12410,20,"亲子井",15208,4} -----亲子井
zzwpid[19] = {"鸡蛋",12404,20,"葱",12004,20,"蕃茄酱",12405,3,"牛肉",11200,20,"汉堡",15209,5} -----汉堡
zzwpid[20] = {"盐",12402,20,"酱油",12409,20,"米",12410,20,"海苔",12407,20,"星鳗",11600,20,"星鳗饭团",15210,5} -----星鳗饭团
zzwpid[21] = {"法国面包",15203,1,"炒面",15204,1,"炒面面包",15205,6} -----炒面面包
zzwpid[22] = {"葱",12004,20,"酱油",12409,20,"盐",12402,20,"牛肉",11200,20,"砂糖",12411,20,"寿喜锅",15322,6} -----寿喜锅
zzwpid[23] = {"葱",12004,20,"鸡肉",11201,20,"马铃薯",12005,20,"米",12410,20,"咖喱块",12403,10,"咖哩饭",15212,7} -----咖哩饭
zzwpid[24] = {"鸡蛋",12404,10,"盐",12402,20,"牛肉",11200,20,"米",12410,20,"辣椒",12406,20,"韩式泡菜饭",15213,7} -----韩式泡菜饭
zzwpid[25] = {"葱",12004,20,"酱油",12409,20,"马铃薯",12005,20,"辣椒",12406,20,"螃蟹",12412,10,"螃蟹锅",15214,8} -----螃蟹锅
zzwpid[26] = {"盐",12402,20,"胡椒",12408,10,"马铃薯",12005,10,"高级奶油",12413,20,"霜降牛肉",11202,20,"牛排",15215,8} -----牛排
zzwpid[27] = {"海苔",12407,20,"星鳗",11600,20,"米",12410,20,"螃蟹",12412,20,"伊势虾",12416,10,"醋饭寿司",15216,9} -----醋饭寿司
zzwpid[28] = {"鸡蛋",12404,20,"酱油",12409,20,"海苔",12407,20,"伊势虾",12416,15,"海胆",12417,15,"豪华寿司组",15217,9} -----豪华寿司组
zzwpid[29] = {"鸡蛋",12404,20,"葱",12004,20,"盐",12402,20,"胡椒",12408,20,"鱼翅",12418,20,"鱼翅汤",15218,10} -----鱼翅汤
zzwpid[30] = {"辣椒",12406,20,"螃蟹",12412,20,"伊势虾",12416,10,"海胆",12417,10,"鳖",12419,20,"鳖料理",15219,10} -----鳖料理

zzwpid[31] = {"铜条",9611,4,"印度轻木",10000,20,"长剑",8,1} -----长剑
zzwpid[32] = {"铜条",9611,4,"铁条",9612,3,"印度轻木",10000,20,"阔剑",3,1}-----阔剑
zzwpid[33] = {"铜条",9611,5,"铁条",9612,4,"印度轻木",10000,20,"突刺剑",16,2}-----突刺剑
zzwpid[34] = {"铜条",9611,7,"铁条",9612,5,"枞",10001,20,"黄月木",10002,20,"火舌剑",18,2}-----火舌剑
zzwpid[35] = {"铜条",9611,7,"铁条",9612,6,"银条",9613,5,"面包剑",22,3}-----面包剑
zzwpid[36] = {"铁条",9612,10,"银条",9613,8,"枞",10001,20,"铁杉",10003,20,"双手剑",28,3}-----双手剑
zzwpid[37] = {"铜条",9611,15,"铁条",9612,5,"纯银条",9614,5,"黄月木",10002,20,"双刃长剑",37,4}-----双刃长剑
zzwpid[38] = {"铁条",9612,10,"纯银条",9614,7,"金条",9615,5,"黄月木",10002,20,"锁刃剑",39,4}-----锁刃剑
zzwpid[39] = {"铁条",9612,10,"银条",9613,3,"纯银条",9614,6,"金条",9615,7,"铁杉",10003,20,"格斗剑",42,5}-----格斗剑
zzwpid[40] = {"铜条",9611,10,"铁条",9612,8,"银条",9613,7,"金条",9615,8,"赤松",10005,20,"长锷剑",48,5}-----长锷剑
zzwpid[41] = {"银条",9613,10,"纯银条",9614,10,"白金条",9616,8,"铁杉",10003,20,"琵琶木",10004,20,"猪牙剑",56,6}-----猪牙剑
zzwpid[42] = {"纯银条",9614,6,"金条",9615,10,"白金条",9616,10,"琵琶木",10004,20,"朴",10006,20,"双刃阔剑",57,6}-----双刃阔剑
zzwpid[43] = {"纯银条",9614,15,"白金条",9616,10,"幻之钢条",9617,7,"赤松",10005,20,"钢骑之矿",18449,1,"巨剑",67,7}-----巨剑
zzwpid[44] = {"纯银条",9614,10,"金条",9615,13,"幻之钢条",9617,11,"印度轻木",10000,20,"朴",10006,20,"长军刀",63,7}-----长军刀
zzwpid[45] = {"铜条",9611,15,"白金条",9616,16,"幻之钢条",9617,13,"杉",10007,20,"魔族的水晶",18450,1,"护身短剑",70,8}-----护身短剑
zzwpid[46] = {"幻之钢条",9617,10,"幻之银条",9618,13,"枞",10001,20,"赤松",10005,20,"杉",10007,20,"细柄短剑",77,8}-----细柄短剑
zzwpid[47] = {"铁条",9612,10,"白金条",9616,10,"幻之钢条",9617,10,"幻之银条",9618,10,"丝柏",10008,20,"细刃重剑",88,9}-----细刃重剑
zzwpid[48] = {"纯银条",9614,10,"幻之银条",9618,10,"勒格耐席鉧条",9619,10,"琵琶木",10004,20,"钢骑之矿",18449,2,"钢硬巨剑",87,9}-----钢硬巨剑
zzwpid[49] = {"金条",9615,10,"幻之银条",9618,10,"勒格耐席鉧条",9619,10,"杉",10007,20,"梣",10009,20,"青龙刀",94,10}-----青龙刀
zzwpid[50] = {"幻之银条",9618,10,"奥利哈钢条",9620,10,"丝柏",10008,20,"钢骑之矿",18449,2,"魔族的水晶",18450,2,"曲刀",97,10}-----曲刀

zzwpid[51] = {"铜条",9611,4,"印度轻木",10000,20,"手斧",805,1} -----手斧
zzwpid[52] = {"铜条",9611,4,"铁条",9612,3,"印度轻木",10000,20,"勇气之斧",809,1}-----勇气之斧
zzwpid[53] = {"铜条",9611,7,"铁条",9612,4,"印度轻木",10000,20,"枞",10001,20,"宽手斧",812,2}-----宽手斧
zzwpid[54] = {"铁条",9612,10,"银条",9613,5,"印度轻木",10000,20,"枞",10001,20,"战斗手斧",811,2}-----战斗手斧
zzwpid[55] = {"铜条",9611,9,"铁条",9612,5,"银条",9613,5,"黄月木",10002,20,"格斗手斧",820,3}-----格斗手斧
zzwpid[56] = {"铜条",9611,10,"铁条",9612,9,"纯银条",9614,4,"黄月木",10002,20,"钢斧",826,3}-----钢斧
zzwpid[57] = {"铜条",9611,8,"铁条",9612,8,"银条",9613,7,"纯银条",9614,3,"铁杉",10003,20,"长战斧",830,4}-----长战斧
zzwpid[58] = {"铁条",9612,10,"银条",9613,7,"纯银条",9614,5,"金条",9615,4,"印度轻木",10000,20,"双刃斧",838,4}-----双刃斧
zzwpid[59] = {"银条",9613,10,"纯银条",9614,10,"金条",9615,5,"枞",10001,20,"琵琶木",10004,20,"钩爪斧",841,5}-----钩爪斧
zzwpid[60] = {"铁条",9612,10,"银条",9613,10,"纯银条",9614,10,"白金条",9616,2,"琵琶木",10004,20,"阔刃斧",842,5}-----阔刃斧
zzwpid[61] = {"纯银条",9614,10,"金条",9615,10,"白金条",9616,6,"黄月木",10002,20,"赤松",10005,20,"弯月大战斧",854,6}-----弯月大战斧
zzwpid[62] = {"银条",9613,8,"纯银条",9614,10,"金条",9615,10,"幻之钢条",9617,3,"赤松",10005,20,"大型阔刃斧",852,6}-----大型阔刃斧
zzwpid[63] = {"铁条",9612,20,"白金条",9616,12,"幻之钢条",9617,6,"琵琶木",10004,20,"赤松",10005,20,"大型双刃斧",863,7}-----大型双刃斧
zzwpid[64] = {"纯银条",9614,20,"白金条",9616,10,"幻之钢条",9617,10,"朴",10006,20,"誓言之证",18451,1,"超大皇帝斧",867,7}-----超大皇帝斧
zzwpid[65] = {"金条",9615,13,"白金条",9616,10,"幻之钢条",9617,10,"赤松",10005,20,"朴",10006,20,"新月斧",878,8}-----新月斧
zzwpid[66] = {"纯银条",9614,10,"幻之钢条",9617,10,"幻之银条",9618,10,"杉",10007,20,"魔族的水晶",18450,1,"米诺陶斯战斧",872,8}-----米诺陶斯战斧
zzwpid[67] = {"白金条",9616,10,"幻之钢条",9617,10,"勒格耐席鉧条",9619,10,"朴",10006,20,"杉",10007,20,"薄刃钩爪斧",883,9}-----薄刃钩爪斧
zzwpid[68] = {"金条",9615,10,"幻之银条",9618,10,"勒格耐席鉧条",9619,10,"丝柏",10008,20,"誓言之证",18451,2,"弯月长柄斧",885,9}-----弯月长柄斧
zzwpid[69] = {"幻之钢条",9617,10,"幻之银条",9618,10,"勒格耐席鉧条",9619,8,"杉",10007,20,"丝柏",10008,20,"金属重斧",890,10}-----金属重斧
zzwpid[70] = {"奥利哈钢条",9620,14,"梣",10009,20,"钢骑之矿",18449,2,"魔族的水晶",18450,2,"誓言之证",18451,2,"处刑斧",895,10}-----处刑斧

zzwpid[71] = {"铜条",9611,4,"印度轻木",10000,20,"短矛",1608,1} -----短矛
zzwpid[72] = {"铜条",9611,4,"铁条",9612,3,"印度轻木",10000,20,"攻城枪",1606,1}-----攻城枪
zzwpid[73] = {"铜条",9611,7,"铁条",9612,4,"印度轻木",10000,20,"枞",10001,20,"刺枪",1619,2}-----刺枪
zzwpid[74] = {"铜条",9611,8,"铁条",9612,5,"印度轻木",10000,20,"枞",10001,20,"金属枪",1613,2}-----金属枪
zzwpid[75] = {"铜条",9611,10,"铁条",9612,6,"银条",9613,3,"枞",10001,20,"黄月木",10002,20,"长柄弯枪",1629,3}-----长柄弯枪
zzwpid[76] = {"铁条",9612,8,"银条",9613,6,"纯银条",9614,5,"枞",10001,20,"黄月木",10002,20,"长柄尖枪",1625,3}-----长柄尖枪
zzwpid[77] = {"铁条",9612,8,"银条",9613,7,"纯银条",9614,7,"黄月木",10002,20,"铁杉",10003,20,"穗枪",1635,4}-----穗枪
zzwpid[78] = {"银条",9613,7,"纯银条",9614,7,"金条",9615,3,"黄月木",10002,20,"铁杉",10003,20,"双叉戟",1634,4}-----双叉戟
zzwpid[79] = {"银条",9613,15,"金条",9615,20,"黄月木",10002,20,"铁杉",10003,20,"琵琶木",10004,20,"护卫枪",1643,5}-----护卫枪
zzwpid[80] = {"银条",9613,15,"白金条",9616,10,"枞",10001,20,"铁杉",10003,20,"琵琶木",10004,20,"骑士枪",1649,5}-----骑士枪
zzwpid[81] = {"纯银条",9614,7,"金条",9615,8,"白金条",9616,10,"琵琶木",10004,20,"赤松",10005,20,"大砍枪",1657,6}-----大砍枪
zzwpid[82] = {"金条",9615,9,"白金条",9616,10,"幻之钢条",9617,5,"铁杉",10003,20,"赤松",10005,20,"长尖枪",1658,6}-----长尖枪
zzwpid[83] = {"银条",9613,15,"白金条",9616,10,"幻之钢条",9617,8,"黄月木",10002,20,"朴",10006,20,"蝎枪",1663,7}-----蝎枪
zzwpid[84] = {"白金条",9616,10,"幻之钢条",9617,14,"钢骑之矿",18449,1,"赤松",10005,20,"朴",10006,20,"双刃枪",1669,7}-----双刃枪
zzwpid[85] = {"幻之银条",9618,20,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"朴",10006,20,"阔刃枪",1678,8}-----阔刃枪
zzwpid[86] = {"白金条",9616,9,"幻之钢条",9617,9,"幻之银条",9618,10,"杉",10007,20,"魔族的水晶",18450,1,"东方长刺枪",1673,8}-----东方长刺枪
zzwpid[87] = {"勒格耐席鉧条",9619,15,"琵琶木",10004,20,"赤松",10005,20,"朴",10006,20,"杉",10007,20,"钩爪枪",1684,9}-----钩爪枪
zzwpid[88] = {"幻之钢条",9617,10,"幻之银条",9618,10,"勒格耐席鉧条",9619,10,"丝柏",10008,20,"钢骑之矿",18449,2,"原始枪",1686,9}-----原始枪
zzwpid[89] = {"奥利哈钢条",9620,10,"赤松",10005,20,"朴",10006,20,"杉",10007,20,"丝柏",10008,20,"三叉战戟",1698,10}-----三叉战戟
zzwpid[90] = {"幻之银条",9618,10,"勒格耐席鉧条",9619,10,"奥利哈钢条",9620,10,"梣",10009,20,"魔族的水晶",18450,3,"异型枪",1695,10}-----异型枪

zzwpid[91] = {"铜条",9611,3,"印度轻木",10000,20,"麻布",10400,1,"轻型弓",2000,1} -----轻型弓
zzwpid[92] = {"铜条",9611,2,"印度轻木",10000,20,"枞",10001,20,"麻布",10400,3,"木棉布",10401,2,"威力短弓",2002,1} -----威力短弓
zzwpid[93] = {"铁条",9612,2,"印度轻木",10000,20,"枞",10001,20,"麻布",10400,5,"木棉布",10401,4,"短战弓",2010,2} -----短战弓
zzwpid[94] = {"铁条",9612,2,"枞",10001,20,"黄月木",10002,20,"麻布",10400,3,"木棉布",10401,6,"猎弓",2017,2} -----猎弓
zzwpid[95] = {"银条",9613,8,"印度轻木",10000,20,"枞",10001,20,"黄月木",10002,20,"毛毡",10402,7,"强弓",2022,3} -----强弓
zzwpid[96] = {"银条",9613,8,"枞",10001,20,"黄月木",10002,20,"铁杉",10003,20,"毛毡",10402,9,"格斗弓",2023,3} -----格斗弓
zzwpid[97] = {"纯银条",9614,10,"枞",10001,20,"黄月木",10002,20,"铁杉",10003,20,"毛毡",10402,10,"狙击之弓",2035,4} -----狙击之弓
zzwpid[98] = {"纯银条",9614,11,"黄月木",10002,20,"铁杉",10003,20,"琵琶木",10004,20,"绵",10403,11,"超强狙击弓",2038,4} -----超强狙击弓
zzwpid[99] = {"纯银条",9614,11,"金条",9615,11,"铁杉",10003,20,"琵琶木",10004,20,"毛毡",10402,5,"杀手长弓",2049,5} -----杀手长弓
zzwpid[100] = {"银条",9613,5,"金条",9615,19,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"冲击弓",2042,5} -----冲击弓
zzwpid[101] = {"金条",9615,12,"白金条",9616,11,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"巨弓",2055,6} -----巨弓
zzwpid[102] = {"金条",9615,13,"白金条",9616,12,"琵琶木",10004,20,"赤松",10005,20,"朴",10006,20,"长格斗弓",2052,6} -----长格斗弓
zzwpid[103] = {"白金条",9616,10,"幻之钢条",9617,10,"绢布",10405,6,"朴",10006,20,"誓言之证",18451,1,"破邪长弓",2063,7} -----破邪长弓
zzwpid[104] = {"白金条",9616,8,"幻之钢条",9617,16,"琵琶木",10004,20,"赤松",10005,20,"朴",10006,20,"月光之弓",2062,7} -----月光之弓
zzwpid[105] = {"白金条",9616,20,"幻之钢条",9617,14,"朴",10006,20,"杉",10007,20,"魔族的水晶",18450,1,"原始石弓",2071,8} -----原始石弓
zzwpid[106] = {"幻之钢条",9617,11,"幻之银条",9618,12,"赤松",10005,20,"朴",10006,20,"杉",10007,20,"重弦弓",2078,8} -----重弦弓
zzwpid[107] = {"幻之钢条",9617,15,"幻之银条",9618,15,"朴",10006,20,"杉",10007,20,"丝柏",10008,20,"平行弓",2082,9} -----平行弓
zzwpid[108] = {"幻之银条",9618,15,"勒格耐席鉧条",9619,10,"杉",10007,20,"丝柏",10008,20,"钢骑之矿",18449,2,"灵魂之弓",2083,9}-----灵魂之弓
zzwpid[109] = {"幻之银条",9618,20,"勒格耐席鉧条",9619,10,"杉",10007,20,"丝柏",10008,20,"梣",10009,20,"摘星之弓",2095,10}-----摘星之弓
zzwpid[110] = {"勒格耐席鉧条",9619,6,"奥利哈钢条",9620,10,"丝柏",10008,20,"梣",10009,20,"魔族的水晶",18450,4,"魔弹",2098,10}-----魔弹

zzwpid[111] = {"铜条",9611,4,"印度轻木",10000,20,"短杖",2404,1} -----短杖
zzwpid[112] = {"铜条",9611,6,"铁条",9612,2,"印度轻木",10000,20,"权杖",2402,1}-----权杖
zzwpid[113] = {"铁条",9612,10,"印度轻木",10000,20,"枞",10001,20,"大地之杖",2413,2}-----大地之杖
zzwpid[114] = {"铁条",9612,12,"印度轻木",10000,20,"枞",10001,20,"黄月木",10002,20,"激流权杖",2418,2}-----激流权杖
zzwpid[115] = {"铁条",9612,14,"银条",9613,2,"印度轻木",10000,20,"枞",10001,20,"黄月木",10002,20,"魔之手杖",2435,3}-----魔之手杖
zzwpid[116] = {"铁条",9612,14,"银条",9613,2,"印度轻木",10000,20,"黄月木",10002,20,"铁杉",10003,20,"魔之权杖",2434,3}-----魔之权杖
zzwpid[117] = {"银条",9613,10,"纯银条",9614,10,"印度轻木",10000,20,"枞",10001,20,"铁杉",10003,20,"贤者手杖",2447,4}-----贤者手杖
zzwpid[118] = {"银条",9613,12,"纯银条",9614,12,"枞",10001,20,"铁杉",10003,20,"琵琶木",10004,20,"贤者权杖",2446,4}-----贤者权杖
zzwpid[119] = {"金条",9615,16,"枞",10001,20,"黄月木",10002,20,"铁杉",10003,20,"琵琶木",10004,20,"琥珀杖",2449,5}-----琥珀杖
zzwpid[120] = {"金条",9615,17,"黄月木",10002,20,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"琥珀权杖",2450,5}-----琥珀权杖
zzwpid[121] = {"白金条",9616,16,"黄月木",10002,20,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"元素之杖",2461,6}-----元素之杖
zzwpid[122] = {"白金条",9616,17,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"朴",10006,20,"神圣之杖",2462,6}-----神圣之杖
zzwpid[123] = {"幻之钢条",9617,18,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"朴",10006,20,"怒音之杖",2473,7}-----怒音之杖
zzwpid[124] = {"白金条",9616,12,"幻之钢条",9617,9,"琵琶木",10004,20,"赤松",10005,20,"朴",10006,20,"隐者之杖",2478,7}-----隐者之杖
zzwpid[125] = {"白金条",9616,10,"幻之钢条",9617,12,"赤松",10005,20,"朴",10006,20,"杉",10007,20,"光明短杖",2488,8}-----光明短杖
zzwpid[126] = {"幻之钢条",9617,10,"幻之银条",9618,7,"赤松",10005,20,"朴",10006,20,"杉",10007,20,"恶魔之杖",2486,8}-----恶魔之杖
zzwpid[127] = {"幻之银条",9618,15,"杉",10007,20,"丝柏",10008,20,"太阳短杖",2492,9}-----太阳短杖
zzwpid[128] = {"幻之银条",9618,15,"杉",10007,20,"丝柏",10008,20,"天使之杖",2495,9}-----天使之杖
zzwpid[129] = {"奥利哈钢条",9620,10,"丝柏",10008,20,"圣者之杖",2493,10}-----圣者之杖
zzwpid[130] = {"勒格耐席鉧条",9619,15,"丝柏",10008,20,"梣",10009,20,"星屑短杖",2497,10}-----星屑短杖

zzwpid[131] = {"铜条",9611,4,"印度轻木",10000,20,"木制大型回力镖",2806,1} -----木制大型回力镖
zzwpid[132] = {"铜条",9611,7,"印度轻木",10000,20,"枞",10001,20,"青铜回力镖",2801,1} -----青铜回力镖
zzwpid[133] = {"铜条",9611,7,"铁条",9612,4,"印度轻木",10000,20,"枞",10001,20,"追迹者",2812,2} -----追迹者
zzwpid[134] = {"铜条",9611,7,"铁条",9612,4,"印度轻木",10000,20,"枞",10001,20,"黄月木",10002,20,"彩光回力镖",2815,2} -----彩光回力镖
zzwpid[135] = {"银条",9613,5,"枞",10001,20,"黄月木",10002,20,"麻布",10400,8,"木棉布",10401,6,"暗杀回力镖",2820,3} -----暗杀回力镖
zzwpid[136] = {"银条",9613,12,"枞",10001,20,"黄月木",10002,20,"铁杉",10003,20,"麻布",10400,10,"杀敌回力镖",2823,3} -----杀敌回力镖
zzwpid[137] = {"枞",10001,20,"黄月木",10002,20,"铁杉",10003,20,"毛毡",10402,10,"绵",10403,11,"狮子回力镖",2834,4} -----狮子回力镖
zzwpid[138] = {"纯银条",9614,11,"黄月木",10002,20,"铁杉",10003,20,"琵琶木",10004,20,"毛毡",10402,15,"锐角回力镖",2832,4} -----锐角回力镖
zzwpid[139] = {"黄月木",10002,20,"铁杉",10003,20,"琵琶木",10004,20,"毛毡",10402,15,"细线",10404,10,"翼鹿回力镖",2848,5} -----翼鹿回力镖
zzwpid[140] = {"金条",9615,20,"黄月木",10002,20,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"回力镖",2843,5} -----回力镖
zzwpid[141] = {"白金条",9616,17,"黄月木",10002,20,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"蛇狮回力镖",2859,6} -----蛇狮回力镖
zzwpid[142] = {"白金条",9616,17,"铁杉",10003,20,"琵琶木",10004,20,"赤松",10005,20,"朴",10006,20,"鸫回力镖",2850,6} -----鸫回力镖
zzwpid[143] = {"金条",9615,10,"幻之钢条",9617,10,"琵琶木",10004,20,"赤松",10005,20,"朴",10006,20,"熊翼回力镖",2862,7} -----熊翼回力镖
zzwpid[144] = {"白金条",9616,8,"幻之钢条",9617,10,"赤松",10005,20,"朴",10006,20,"钢骑之矿",18449,1,"闪光回力镖",2863,7} -----闪光回力镖
zzwpid[145] = {"白金条",9616,10,"幻之钢条",9617,12,"赤松",10005,20,"朴",10006,20,"杉",10007,20,"凶豹回力镳",2871,8} -----凶豹回力镳
zzwpid[146] = {"幻之银条",9618,10,"铁杉",10003,20,"朴",10006,20,"细线",10404,10,"魔族的水晶",18450,1,"赤狮回力镳",2874,8} -----赤狮回力镳
zzwpid[147] = {"幻之钢条",9617,10,"幻之银条",9618,10,"朴",10006,20,"杉",10007,20,"丝柏",10008,20,"天使之翼",2887,9} -----天使之翼
zzwpid[148] = {"勒格耐席鉧条",9619,10,"杉",10007,20,"丝柏",10008,20,"钢骑之矿",18449,1,"魔族的水晶",18450,1,"普利辛回力镖",2889,9}-----普利辛回力镖
zzwpid[149] = {"勒格耐席鉧条",9619,15,"杉",10007,20,"丝柏",10008,20,"梣",10009,20,"治愈回力镖",2898,10}-----治愈回力镖
zzwpid[150] = {"奥利哈钢条",9620,10,"丝柏",10008,20,"梣",10009,20,"火焰之魂",18452,4,"誓言之证",18451,2,"天秤回力镖",2899,10}-----天秤回力镖

zzwpid[151] = {"铜条",9611,4,"印度轻木",10000,20,"小刀",3201,1} -----小刀
zzwpid[152] = {"铜条",9611,4,"铁条",9612,2,"枞",10001,20,"锐刃小刀",3204,1} -----锐刃小刀
zzwpid[153] = {"铜条",9611,6,"铁条",9612,3,"枞",10001,20,"木棉布",10401,3,"圆盘小刀",3212,2} -----圆盘小刀
zzwpid[154] = {"铁条",9612,7,"银条",9613,3,"枞",10001,20,"黄月木",10002,20,"木棉布",10401,4,"细刃掷刀",3213,2} -----细刃掷刀
zzwpid[155] = {"铁条",9612,8,"银条",9613,5,"枞",10001,20,"黄月木",10002,20,"毛毡",10402,4,"滑翔小刀",3222,3} -----滑翔小刀
zzwpid[156] = {"银条",9613,7,"纯银条",9614,5,"黄月木",10002,20,"铁杉",10003,20,"毛毡",10402,7,"细直刃小刀",3229,3} -----细直刃小刀
zzwpid[157] = {"银条",9613,8,"纯银条",9614,7,"黄月木",10002,20,"铁杉",10003,20,"绵",10403,7,"耳柄小刀",3230,4} -----耳柄小刀
zzwpid[158] = {"纯银条",9614,7,"金条",9615,7,"铁杉",10003,20,"琵琶木",10004,20,"绵",10403,8,"骑士小刀",3235,4} -----骑士小刀
zzwpid[159] = {"纯银条",9614,7,"金条",9615,8,"铁杉",10003,20,"琵琶木",10004,20,"细线",10404,8,"球锷小刀",3245,5} -----球锷小刀
zzwpid[160] = {"纯银条",9614,8,"金条",9615,7,"白金条",9616,7,"铁杉",10003,20,"赤松",10005,20,"双刃小刀",3241,5} -----双刃小刀
zzwpid[161] = {"纯银条",9614,8,"金条",9615,7,"白金条",9616,8,"琵琶木",10004,20,"赤松",10005,20,"阔刃小刀",3251,6} -----阔刃小刀
zzwpid[162] = {"幻之钢条",9617,15,"琵琶木",10004,20,"赤松",10005,20,"触角小刀",3253,6} -----触角小刀
zzwpid[163] = {"幻之钢条",9617,15,"赤松",10005,20,"朴",10006,20,"细线",10404,10,"神眼",18443,1,"汉拉堤小刀",3260,7} -----汉拉堤小刀
zzwpid[164] = {"白金条",9616,10,"幻之钢条",9617,10,"铁杉",10003,20,"赤松",10005,20,"朴",10006,20,"凶杀刀",3269,7} -----凶杀刀
zzwpid[165] = {"幻之钢条",9617,20,"赤松",10005,20,"朴",10006,20,"杉",10007,20,"魔族的水晶",18450,1,"切肉小刀",3276,8} -----切肉小刀
zzwpid[166] = {"幻之银条",9618,14,"黄月木",10002,20,"铁杉",10003,20,"赤松",10005,20,"朴",10006,20,"古传小刀",3279,8} -----古传小刀
zzwpid[167] = {"幻之银条",9618,20,"赤松",10005,20,"朴",10006,20,"杉",10007,20,"华丽小刀",3288,9} -----华丽小刀
zzwpid[168] = {"勒格耐席鉧条",9619,15,"朴",10006,20,"杉",10007,20,"钢骑之矿",18449,1,"誓言之证",18451,1,"手里剑",3281,9}-----手里剑
zzwpid[169] = {"勒格耐席鉧条",9619,15,"朴",10006,20,"杉",10007,20,"丝柏",10008,20,"梣",10009,20,"勾爪掷刀",3294,10}-----勾爪掷刀
zzwpid[170] = {"奥利哈钢条",9620,10,"梣",10009,20,"神眼",18443,1,"钢骑之矿",18449,1,"誓言之证",18451,1,"幻之匕首",3299,10}-----幻之匕首


zzwpid[171] = {"鹿皮",18211,20,"麻布",10400,2,"硬皮头盔",3601,1} -----硬皮头盔
zzwpid[172] = {"铜条",9611,3,"麻布",10400,3,"铜制头盔",3602,1} -----铜制头盔
zzwpid[173] = {"铜条",9611,4,"铁条",9612,2,"麻布",10400,3,"铁板布盔",3611,2} -----铁板布盔
zzwpid[174] = {"铜条",9611,5,"铁条",9612,3,"麻布",10400,2,"木棉布",10401,2,"铜铁皮盔",3612,2} -----铜铁皮盔
zzwpid[175] = {"铜条",9611,4,"铁条",9612,5,"银条",9613,3,"木棉布",10401,2,"金属护额",3622,3} -----金属护额
zzwpid[176] = {"铜条",9611,3,"铁条",9612,10,"银条",9613,3,"毛毡",10402,1,"铁制头盔",3620,3} -----铁制头盔
zzwpid[177] = {"铜条",9611,4,"铁条",9612,4,"银条",9613,5,"纯银条",9614,5,"霸葛头盔",3632,4} -----霸葛头盔
zzwpid[178] = {"铜条",9611,5,"铁条",9612,5,"银条",9613,5,"纯银条",9614,5,"绵",10403,2,"角饰头盔",3635,4} -----角饰头盔
zzwpid[179] = {"纯银条",9614,5,"金条",9615,8,"绵",10403,5,"开放式头盔",3642,5} -----开放式头盔
zzwpid[180] = {"纯银条",9614,5,"金条",9615,5,"绵",10403,5,"细线",10404,5,"葛理克头盔",3640,5} -----葛理克头盔
zzwpid[181] = {"金条",9615,5,"白金条",9616,8,"细线",10404,5,"巴比克头盔",3654,6} -----巴比克头盔
zzwpid[182] = {"金条",9615,5,"白金条",9616,5,"细线",10404,5,"绢布",10405,5,"利刃头盔",3651,6} -----利刃头盔
zzwpid[183] = {"金条",9615,8,"白金条",9616,4,"幻之钢条",9617,5,"绢布",10405,4,"钢骑之矿",18449,1,"骑士头盔",3662,7} -----骑士头盔
zzwpid[184] = {"白金条",9616,5,"幻之钢条",9617,5,"细线",10404,9,"琵琶木",10004,20,"朴",10006,20,"钢制头盔",3664,7} -----骑士头盔
zzwpid[185] = {"幻之钢条",9617,5,"幻之银条",9618,5,"绢布",10405,5,"朴",10006,20,"誓言之证",18451,5,"博流盖尔头盔",3670,8}-----博流盖尔头盔
zzwpid[186] = {"铁条",9612,10,"幻之银条",9618,5,"莎莲娜线",10406,5,"朴",10006,20,"铆钉头盔",3671,8}-----铆钉头盔
zzwpid[187] = {"幻之银条",9618,3,"勒格耐席鉧条",9619,5,"朴",10006,20,"杉",10007,20,"莎莲娜线",10406,3,"羽毛头盔",3683,9}-----羽毛头盔
zzwpid[188] = {"勒格耐席鉧条",9619,8,"丝柏",10008,20,"莎莲娜线",10406,4,"誓言之证",18451,1,"钢骑之矿",18449,1,"龙盔",3682,9}-----龙盔
zzwpid[189] = {"幻之银条",9618,3,"勒格耐席鉧条",9619,5,"奥利哈钢条",9620,3,"丝柏",10008,20,"莎莲娜线",10406,3,"白金头盔",3693,10}-----白金头盔
zzwpid[190] = {"勒格耐席鉧条",9619,5,"奥利哈钢条",9620,5,"梣",10009,20,"钢骑之矿",18449,4,"魔族的水晶",18450,4,"圣龙头盔",3692,10}-----圣龙头盔

zzwpid[191] = {"鹿皮",18211,20,"麻布",10400,2,"麻布帽",4004,1} -----麻布帽
zzwpid[192] = {"印度轻木",10000,20,"鹿皮",18211,20,"麻布",10400,4,"硬帽",4001,1} -----硬帽
zzwpid[193] = {"印度轻木",10000,20,"柠檬草",12801,20,"麻布",10400,5,"木棉布",10401,2,"轻帽",4011,2} -----轻帽
zzwpid[194] = {"枞",10001,20,"柠檬草",12801,20,"鹿皮",18211,20,"麻布",10400,6,"木棉布",10401,3,"皮帽",4013,2} -----皮帽
zzwpid[195] = {"铜条",9611,4,"鹿皮",18211,20,"木棉布",10401,5,"毛毡",10402,4,"硬皮帽",4022,3} -----硬皮帽
zzwpid[196] = {"果梨",12803,20,"麻布",10400,6,"木棉布",10401,6,"毛毡",10402,5,"可爱的帽子",4020,3} -----可爱的帽子
zzwpid[197] = {"柠檬草",12801,20,"蝴蝶花",12802,20,"麻布",10400,6,"毛毡",10402,6,"绵",10403,6,"时髦帽子",4032,4} -----时髦帽子
zzwpid[198] = {"果梨",12803,20,"鹿皮",18211,20,"木棉布",10401,11,"毛毡",10402,11,"鸭舌帽",4031,4} -----鸭舌帽
zzwpid[199] = {"果梨",12803,20,"绵",10403,7,"细线",10404,10,"蓝徽章之帽",4040,5} -----蓝徽章之帽
zzwpid[200] = {"桃木",12804,20,"绵",10403,8,"绢布",10405,10,"高级帽子",4042,5} -----高级帽子
zzwpid[201] = {"绵",10403,19,"柠檬草",12801,20,"蝴蝶花",12802,20,"果梨",12803,20,"桃木",12804,20,"装饰着花的帽子",4054,6} -----装饰着花的帽子
zzwpid[202] = {"铜条",9611,15,"绵",10403,14,"番红花",12805,20,"青铜帽子",4051,6} -----青铜帽子
zzwpid[203] = {"细线",10404,10,"绢布",10405,10,"百里香",12806,20,"水的水晶碎片",18311,5,"淑女帽",4064,7} -----淑女帽
zzwpid[204] = {"桃木",12804,20,"百里香",12806,20,"莎莲娜线",10406,13,"火的水晶碎片",18312,5,"可爱的扁帽子",4062,7} -----可爱的扁帽子
zzwpid[205] = {"瞿麦",12807,20,"绵",10403,5,"细线",10404,5,"莎莲娜线",10406,10,"军帽",4070,8} -----军帽
zzwpid[206] = {"番红花",12805,20,"瞿麦",12807,20,"杰诺瓦线",10407,10,"德特家的布",18453,1,"时髦避暑帽子",4074,8} -----时髦避暑帽子
zzwpid[207] = {"百里香",12806,20,"茴香",12808,20,"鹿皮",18211,20,"莎莲娜线",10406,6,"杰诺瓦线",10407,8,"羽毛帽",4082,9} -----羽毛帽
zzwpid[208] = {"瞿麦",12807,20,"茴香",12808,20,"毛毡",10402,20,"杰诺瓦线",10407,10,"魔族的水晶",18450,2,"魔术师之帽",4084,9} -----魔术师之帽
zzwpid[209] = {"七叶树",12809,20,"绵",10403,5,"杰诺瓦线",10407,5,"细麻布",10408,7,"黄昏之帽",4091,10} -----黄昏之帽
zzwpid[210] = {"七叶树",12809,20,"开米士毛线",10409,5,"绢布",10405,5,"曼陀罗草的皮",18454,5,"德特家的布",18453,2,"妖精之帽",4092,10} -----妖精之帽

zzwpid[211] = {"铜条",9611,3,"印度轻木",10000,20,"鹿皮",18211,20,"软皮甲",4400,1} -----软皮甲
zzwpid[212] = {"铜条",9611,4,"铁条",9612,3,"印度轻木",10000,20,"护心甲",4405,1} -----护心甲
zzwpid[213] = {"铜条",9611,7,"铁条",9612,2,"印度轻木",10000,20,"枞",10001,20,"青铜铠甲",4410,2} -----青铜铠甲
zzwpid[214] = {"铜条",9611,4,"铁条",9612,5,"银条",9613,3,"鹿皮",18211,20,"轻型铠甲",4411,2} -----轻型铠甲
zzwpid[215] = {"铜条",9611,4,"铁条",9612,5,"黄月木",10002,20,"轻型锁炼甲",4420,3} -----轻型锁炼甲
zzwpid[216] = {"铜条",9611,5,"铁条",9612,4,"银条",9613,5,"纯银条",9614,4,"枞",10001,20,"环甲",4421,3} -----环甲
zzwpid[217] = {"铁条",9612,13,"银条",9613,4,"纯银条",9614,2,"黄月木",10002,20,"钢铁铠甲",4430,4} -----钢铁铠甲
zzwpid[218] = {"铁条",9612,6,"银条",9613,9,"纯银条",9614,8,"黄月木",10002,20,"琵琶木",10004,20,"金属皮甲",4434,4} -----金属皮甲
zzwpid[219] = {"铁条",9612,5,"银条",9613,10,"纯银条",9614,7,"金条",9615,5,"铁杉",10003,20,"长型金属铠甲",4442,5} -----长型金属铠甲
zzwpid[220] = {"铁条",9612,5,"银条",9613,5,"纯银条",9614,8,"金条",9615,10,"琵琶木",10004,20,"索状铠甲",4444,5} -----索状铠甲
zzwpid[221] = {"银条",9613,5,"纯银条",9614,5,"金条",9615,6,"白金条",9616,10,"琵琶木",10004,20,"重铁板甲",4459,6} -----重铁板甲
zzwpid[222] = {"银条",9613,6,"纯银条",9614,6,"金条",9615,6,"白金条",9616,10,"赤松",10005,20,"铁板半身甲",4458,6} -----铁板半身甲
zzwpid[223] = {"铁条",9612,20,"金条",9615,5,"白金条",9616,5,"幻之钢条",9617,8,"赤松",10005,20,"实战铠甲",4464,7} -----实战铠甲
zzwpid[224] = {"纯银条",9614,10,"金条",9615,10,"白金条",9616,10,"幻之钢条",9617,10,"曼陀罗草的皮",18454,1,"黄金铠甲",4461,7} -----黄金铠甲
zzwpid[225] = {"铁条",9612,20,"幻之钢条",9617,10,"幻之银条",9618,10,"重金属铠甲",4470,8} -----重金属铠甲
zzwpid[226] = {"银条",9613,15,"幻之钢条",9617,20,"赤松",10005,20,"风龙蜥的甲壳",18455,1,"野兽铠甲",4471,8} -----野兽铠甲
zzwpid[227] = {"幻之钢条",9617,10,"幻之银条",9618,10,"勒格耐席鉧条",9619,10,"杉",10007,20,"帝王之铠",4484,9} -----帝王之铠
zzwpid[228] = {"铁条",9612,20,"幻之钢条",9617,10,"幻之银条",9618,10,"勒格耐席鉧条",9619,12,"魔族的水晶",18450,5,"亡灵铠甲",4481,9} -----亡灵铠甲
zzwpid[229] = {"白金条",9616,5,"幻之钢条",9617,5,"幻之银条",9618,10,"勒格耐席鉧条",9619,10,"奥利哈钢条",9620,5,"漆黑之铠",4490,10} -----漆黑之铠
zzwpid[230] = {"金条",9615,20,"勒格耐席鉧条",9619,10,"奥利哈钢条",9620,10,"钢骑之矿",18449,5,"魔族的水晶",18450,5,"骑士铠甲",4491,10} -----骑士铠甲

zzwpid[231] = {"鹿皮",18211,20,"麻布",10400,4,"印度轻木",10000,10,"旅人之服",4803,1} -----旅人之服
zzwpid[232] = {"铜条",9611,3,"鹿皮",18211,20,"麻布",10400,3,"木棉布",10401,2,"保护衣",4806,1} -----保护衣
zzwpid[233] = {"鹿皮",18211,20,"麻布",10400,11,"木棉布",10401,2,"羽毛装",4812,2} -----羽毛装
zzwpid[234] = {"铜条",9611,2,"鹿皮",18211,20,"麻布",10400,5,"木棉布",10401,5,"毛毡",10402,4,"皮装",4813,2} -----皮装
zzwpid[235] = {"银条",9613,3,"鹿皮",18211,20,"麻布",10400,5,"木棉布",10401,5,"毛毡",10402,6,"硬皮服",4823,3} -----硬皮服
zzwpid[236] = {"铁条",9612,15,"银条",9613,5,"鹿皮",18211,20,"绵",10403,2,"锁炼装",4821,3} -----锁炼装
zzwpid[237] = {"银条",9613,5,"鹿皮",18211,20,"毛毡",10402,7,"绵",10403,10,"布甲",4834,4} -----布甲
zzwpid[238] = {"金条",9615,4,"鹿皮",18211,20,"毛毡",10402,10,"绵",10403,10,"榇甲",4833,4} -----榇甲
zzwpid[239] = {"铁条",9612,10,"金条",9615,5,"鹿皮",18211,20,"绵",10403,6,"细线",10404,5,"环服",4845,5} -----环服
zzwpid[240] = {"银条",9613,5,"白金条",9616,5,"鹿皮",18211,20,"绵",10403,10,"细线",10404,5,"士兵护衣",4844,5} -----士兵护衣
zzwpid[241] = {"铁条",9612,10,"银条",9613,7,"白金条",9616,5,"鹿皮",18211,20,"绵",10403,10,"长索锥衣",4855,6} -----长索锥衣
zzwpid[242] = {"铁条",9612,15,"金条",9615,5,"白金条",9616,5,"鹿皮",18211,20,"绵",10403,10,"索锥上衣",4853,6} -----索锥上衣
zzwpid[243] = {"绵",10403,20,"莎莲娜线",10406,10,"妖草的血",18456,1,"超级衣服",4860,7} -----超级衣服
zzwpid[244] = {"白金条",9616,5,"绵",10403,5,"绢布",10405,5,"莎莲娜线",10406,10,"骨衣",4867,7} -----骨衣
zzwpid[245] = {"地的水晶碎片",18310,50,"水的水晶碎片",18311,50,"火的水晶碎片",18312,50,"风的水晶碎片",18313,50,"杰诺瓦线",10407,20,"疾风之衣",4871,8} -----疾风之衣
zzwpid[246] = {"铁条",9612,10,"幻之银条",9618,5,"绵",10403,10,"绢布",10405,10,"杰诺瓦线",10407,5,"步兵战衣",4873,8} -----步兵战衣
zzwpid[247] = {"勒格耐席鉧条",9619,1,"木棉布",10401,10,"细线",10404,10,"杰诺瓦线",10407,5,"细麻布",10408,10,"勇者之衣",4882,9}-----勇者之衣
zzwpid[248] = {"绢布",10405,10,"杰诺瓦线",10407,10,"细麻布",10408,15,"魔族的水晶",18450,1,"誓言之证",18451,1,"女神之衣",4883,9} -----女神之衣
zzwpid[249] = {"奥利哈钢条",9620,1,"绵",10403,10,"绢布",10405,10,"杰诺瓦线",10407,10,"开米士毛线",10409,10,"不死鸟之服",4892,10}-----不死鸟之服
zzwpid[250] = {"绢布",10405,20,"开米士毛线",10409,15,"神眼",18443,1,"妖草的血",18456,1,"魔族的水晶",18450,4,"灵魂之服",4893,10}-----灵魂之服

zzwpid[251] = {"鹿皮",18211,20,"麻布",10400,4,"印度轻木",10000,10,"羽毛袍",5206,1} -----羽毛袍
zzwpid[252] = {"鹿皮",18211,20,"麻布",10400,5,"木棉布",10401,4,"印度轻木",10000,10,"轻皮袍",5205,1} -----轻皮袍
zzwpid[253] = {"鹿皮",18211,20,"麻布",10400,2,"木棉布",10401,10,"枞",10001,10,"网袍",5212,2} -----网袍
zzwpid[254] = {"鹿皮",18211,20,"麻布",10400,4,"木棉布",10401,10,"毛毡",10402,2,"枞",10001,10,"风袍",5211,2} -----风袍
zzwpid[255] = {"鹿皮",18211,20,"麻布",10400,7,"木棉布",10401,8,"毛毡",10402,5,"黄月木",10002,10,"硬皮袍",5224,3} -----硬皮袍
zzwpid[256] = {"铁条",9612,8,"麻布",10400,5,"毛毡",10402,7,"绵",10403,3,"黄月木",10002,10,"环袍",5223,3} -----环袍
zzwpid[257] = {"鹿皮",18211,20,"麻布",10400,10,"毛毡",10402,10,"绵",10403,6,"铁杉",10003,10,"乌鸦之袍",5233,4} -----乌鸦之袍
zzwpid[258] = {"鹿皮",18211,20,"麻布",10400,6,"毛毡",10402,10,"细线",10404,11,"铁杉",10003,10,"月亮之袍",5231,4} -----月亮之袍
zzwpid[259] = {"鹿皮",18211,20,"麻布",10400,10,"绵",10403,10,"绢布",10405,10,"铁杉",10003,10,"东方法衣",5242,5} -----东方法衣
zzwpid[260] = {"纯银条",9614,5,"鹿皮",18211,20,"麻布",10400,5,"绢布",10405,15,"琵琶木",10004,10,"圣堂之袍",5244,5} -----圣堂之袍
zzwpid[261] = {"金条",9615,10,"绵",10403,13,"绢布",10405,5,"赤松",10005,10,"圣者之袍",5250,6} -----圣者之袍
zzwpid[262] = {"白金条",9616,5,"鹿皮",18211,20,"绵",10403,20,"细线",10404,6,"赤松",10005,10,"战斗长袍",5253,6} -----战斗长袍
zzwpid[263] = {"纯银条",9614,10,"白金条",9616,10,"莎莲娜线",10406,20,"誓言之证",18451,1,"冠军之袍",5261,7} -----冠军之袍
zzwpid[264] = {"金条",9615,10,"幻之钢条",9617,5,"绵",10403,5,"莎莲娜线",10406,10,"时之袍",5262,7} -----时之袍
zzwpid[265] = {"幻之银条",9618,10,"绵",10403,5,"绢布",10405,5,"杰诺瓦线",10407,5,"神眼",18443,1,"死神之袍",5272,8} -----死神之袍
zzwpid[266] = {"白金条",9616,5,"幻之银条",9618,10,"绵",10403,5,"绢布",10405,5,"杰诺瓦线",10407,5,"勇者之袍",5274,8} -----勇者之袍
zzwpid[267] = {"勒格耐席鉧条",9619,3,"毛毡",10402,5,"绢布",10405,5,"杰诺瓦线",10407,5,"细麻布",10408,8,"黑暗之袍",5281,9}-----黑暗之袍
zzwpid[268] = {"勒格耐席鉧条",9619,3,"细线",10404,10,"细麻布",10408,10,"魔族的水晶",18450,1,"誓言之证",18451,2,"圣袍",5282,9}-----圣袍
zzwpid[269] = {"奥利哈钢条",9620,2,"绵",10403,10,"绢布",10405,10,"杰诺瓦线",10407,10,"开米士毛线",10409,5,"灵魂之袍",5290,10}-----灵魂之袍
zzwpid[270] = {"奥利哈钢条",9620,5,"细线",10404,10,"细麻布",10408,15,"神眼",18443,1,"魔族的水晶",18450,5,"奇迹之袍",5291,10}-----奇迹之袍

zzwpid[271] = {"鹿皮",18211,20,"麻布",10400,4,"软皮靴",5600,1} -----软皮靴
zzwpid[272] = {"铜条",9611,7,"鹿皮",18211,20,"皮靴",5601,1} -----皮靴
zzwpid[273] = {"铜条",9611,5,"鹿皮",18211,20,"木棉布",10401,4,"硬皮靴",5614,2} -----硬皮靴
zzwpid[274] = {"铜条",9611,3,"鹿皮",18211,20,"麻布",10400,3,"木棉布",10401,3,"毛毡",10402,3,"长靴",5612,2} -----长靴
zzwpid[275] = {"印度轻木",10000,20,"鹿皮",18211,20,"麻布",10400,8,"木棉布",10401,4,"毛毡",10402,3,"厚底靴",5620,3} -----厚底靴
zzwpid[276] = {"枞",10001,20,"鹿皮",18211,20,"麻布",10400,5,"毛毡",10402,9,"绵",10403,2,"编织的靴子",5621,3} -----编织的靴子
zzwpid[277] = {"铁条",9612,6,"银条",9613,6,"麻布",10400,6,"绵",10403,3,"锁炼长靴",5630,4} -----锁炼长靴
zzwpid[278] = {"铁条",9612,8,"银条",9613,3,"纯银条",9614,3,"毛毡",10402,3,"细线",10404,3,"锁炼靴",5631,4} -----锁炼靴
zzwpid[279] = {"铁条",9612,10,"金条",9615,5,"毛毡",10402,3,"绵",10403,3,"蜥蜴靴",5640,5} -----蜥蜴靴
zzwpid[280] = {"纯银条",9614,5,"金条",9615,4,"绵",10403,5,"细线",10404,5,"蜥蜴长靴",5641,5} -----蜥蜴长靴
zzwpid[281] = {"铁条",9612,20,"白金条",9616,5,"钢靴",5653,6} -----钢靴
zzwpid[282] = {"银条",9613,8,"纯银条",9614,7,"白金条",9616,7,"钢制长靴",5654,6} -----钢制长靴
zzwpid[283] = {"铁条",9612,10,"金条",9615,8,"幻之钢条",9617,5,"水晶靴",5664,7} -----水晶靴
zzwpid[284] = {"金条",9615,5,"白金条",9616,5,"幻之钢条",9617,7,"钢骑之矿",18449,1,"银靴",5660,7} -----银靴
zzwpid[285] = {"铁条",9612,4,"纯银条",9614,4,"幻之银条",9618,5,"莎莲娜线",10406,5,"流水之靴",5671,8} -----流水之靴
zzwpid[286] = {"幻之钢条",9617,10,"幻之银条",9618,5,"莎莲娜线",10406,5,"火焰之魂",18452,1,"芙蕾雅之靴",5673,8} -----芙蕾雅之靴
zzwpid[287] = {"白金条",9616,5,"幻之钢条",9617,5,"勒格耐席鉧条",9619,4,"杰诺瓦线",10407,5,"钻石靴",5680,9} -----钻石靴
zzwpid[288] = {"幻之银条",9618,10,"勒格耐席鉧条",9619,5,"陨石",18373,1,"钢骑之矿",18449,2,"钻石长靴",5681,9} -----钻石长靴
zzwpid[289] = {"金条",9615,5,"幻之钢条",9617,5,"奥利哈钢条",9620,5,"细麻布",10408,5,"秘密之靴",5690,10} -----秘密之靴
zzwpid[290] = {"勒格耐席鉧条",9619,5,"奥利哈钢条",9620,8,"钢骑之矿",18449,5,"誓言之证",18451,1,"龙之靴",5691,10} -----龙之靴

zzwpid[291] = {"鹿皮",18211,20,"麻布",10400,4,"运动鞋",6001,1} -----运动鞋
zzwpid[292] = {"铜条",9611,3,"鹿皮",18211,20,"麻布",10400,3,"马车鞋",6002,1} -----马车鞋
zzwpid[293] = {"鹿皮",18211,20,"麻布",10400,4,"木棉布",10401,4,"皮鞋",6010,2} -----皮鞋
zzwpid[294] = {"铁条",9612,4,"鹿皮",18211,20,"麻布",10400,4,"木棉布",10401,3,"安全鞋",6011,2} -----安全鞋
zzwpid[295] = {"鹿皮",18211,20,"麻布",10400,5,"木棉布",10401,4,"毛毡",10402,4,"光之鞋",6022,3} -----光之鞋
zzwpid[296] = {"铜条",9611,4,"铁条",9612,5,"鹿皮",18211,20,"麻布",10400,2,"毛毡",10402,5,"战鞋",6025,3} -----战鞋
zzwpid[297] = {"铜条",9611,10,"铁条",9612,3,"银条",9613,3,"鹿皮",18211,20,"绵",10403,3,"薄板鞋",6033,4} -----薄板鞋
zzwpid[298] = {"铜条",9611,10,"铁条",9612,6,"银条",9613,2,"纯银条",9614,2,"毛毡",10402,2,"锁炼鞋",6031,4} -----锁炼鞋
zzwpid[299] = {"银条",9613,5,"纯银条",9614,6,"金条",9615,3,"毛毡",10402,6,"蜥蜴鞋",6042,5} -----蜥蜴鞋
zzwpid[300] = {"铜条",9611,7,"银条",9613,5,"纯银条",9614,5,"金条",9615,5,"鹿皮",18211,20,"维京鞋",6040,5} -----维京鞋
zzwpid[301] = {"铁条",9612,20,"白金条",9616,5,"战斗鞋",6054,6} -----战斗鞋
zzwpid[302] = {"银条",9613,10,"纯银条",9614,8,"白金条",9616,5,"鹿皮",18211,20,"骑士鞋",6052,6} -----骑士鞋
zzwpid[303] = {"纯银条",9614,5,"白金条",9616,5,"幻之钢条",9617,5,"莎莲娜线",10406,3,"妖精鞋",6064,7} -----妖精鞋
zzwpid[304] = {"银条",9613,5,"金条",9615,5,"幻之钢条",9617,8,"陨石",18373,1,"紫水晶鞋",6063,7} -----紫水晶鞋
zzwpid[305] = {"纯银条",9614,5,"白金条",9616,5,"幻之银条",9618,5,"杰诺瓦线",10407,3,"白金鞋",6072,8} -----白金鞋
zzwpid[306] = {"幻之钢条",9617,10,"幻之银条",9618,10,"大炸弹的卡片",14904,1,"精致高级鞋",6074,8} -----精致高级鞋
zzwpid[307] = {"幻之银条",9618,5,"勒格耐席鉧条",9619,4,"绢布",10405,5,"细麻布",10408,4,"神秘之鞋",6080,9} -----神秘之鞋
zzwpid[308] = {"勒格耐席鉧条",9619,10,"莎莲娜线",10406,10,"钢骑之矿",18449,2,"陨石",18373,1,"力量之鞋",6081,9} -----力量之鞋
zzwpid[309] = {"幻之银条",9618,5,"奥利哈钢条",9620,5,"毛毡",10402,5,"开米士毛线",10409,5,"黄金鞋",6090,10} -----黄金鞋
zzwpid[310] = {"奥利哈钢条",9620,10,"杰诺瓦线",10407,10,"钢骑之矿",18449,3,"誓言之证",18451,2,"龙之鞋",6091,10} -----龙之鞋

zzwpid[311] = {"铜条",9611,4,"麻布",10400,1,"小圆盾",6401,1} -----小圆盾
zzwpid[312] = {"铜条",9611,6,"枞",10001,20,"小型盾",6402,1} -----小型盾
zzwpid[313] = {"铜条",9611,8,"印度轻木",10000,20,"枞",10001,20,"板盾",6410,2} -----板盾
zzwpid[314] = {"铜条",9611,7,"铁条",9612,3,"印度轻木",10000,20,"黄月木",10002,20,"鸢盾",6412,2} -----鸢盾
zzwpid[315] = {"铁条",9612,7,"银条",9613,3,"印度轻木",10000,20,"枞",10001,20,"黄月木",10002,20,"漩涡重盾",6427,3} -----漩涡重盾
zzwpid[316] = {"铜条",9611,3,"铁条",9612,4,"银条",9613,4,"纯银条",9614,3,"黄月木",10002,20,"哥特盾",6425,3} -----哥特盾
zzwpid[317] = {"铜条",9611,4,"铁条",9612,4,"银条",9613,4,"纯银条",9614,4,"铁杉",10003,20,"士兵盾",6437,4} -----士兵盾
zzwpid[318] = {"铜条",9611,2,"铁条",9612,2,"银条",9613,3,"纯银条",9614,5,"金条",9615,5,"重盾",6434,4} -----重盾
zzwpid[319] = {"铁条",9612,6,"银条",9613,5,"纯银条",9614,4,"金条",9615,3,"琵琶木",10004,10,"蜥蜴盾",6447,5} -----蜥蜴盾
zzwpid[320] = {"铁条",9612,6,"银条",9613,6,"金条",9615,4,"白金条",9616,3,"反光之盾",6449,5} -----反光之盾
zzwpid[321] = {"纯银条",9614,6,"金条",9615,6,"白金条",9616,4,"赤松",10005,20,"风之盾",6458,6} -----风之盾
zzwpid[322] = {"银条",9613,8,"金条",9615,4,"幻之钢条",9617,4,"琵琶木",10004,20,"赤松",10005,20,"狮子盾",6457,6} -----狮子盾
zzwpid[323] = {"铁条",9612,5,"银条",9613,5,"纯银条",9614,5,"白金条",9616,5,"幻之钢条",9617,5,"防守之盾",6461,7} -----防守之盾
zzwpid[324] = {"金条",9615,5,"白金条",9616,5,"幻之钢条",9617,15,"钢骑之矿",18449,1,"黄金之盾",6463,7} -----黄金之盾
zzwpid[325] = {"银条",9613,6,"纯银条",9614,6,"幻之银条",9618,10,"镜之盾",6470,8} -----镜之盾
zzwpid[326] = {"幻之银条",9618,20,"魔族的水晶",18450,1,"力量之盾",6477,8} -----力量之盾
zzwpid[327] = {"纯银条",9614,5,"幻之钢条",9617,5,"幻之银条",9618,5,"勒格耐席鉧条",9619,5,"漆黑之盾",6480,9} -----漆黑之盾
zzwpid[328] = {"白金条",9616,5,"勒格耐席鉧条",9619,10,"钢骑之矿",18449,1,"魔族的水晶",18450,3,"火龙之盾",6481,9} -----火龙之盾
zzwpid[329] = {"幻之钢条",9617,5,"幻之银条",9618,5,"勒格耐席鉧条",9619,5,"奥利哈钢条",9620,3,"黑暗之盾",6490,10} -----黑暗之盾
zzwpid[330] = {"金条",9615,10,"奥利哈钢条",9620,8,"誓言之证",18451,3,"魔族的水晶",18450,5,"勇者之盾",6491,10} -----勇者之盾

-----------------------------------------------
zdwqcs_index = zdwqcs_index or nil;
-----------------------------------------------
Delegate.RegInit("zdwqcs_Init");

function zdwqcsMyinit(index)
    return 1;
end

function initzdwqcsNpc()
	if (zdwqcs_index == nil) then
		zdwqcs_index = NL.CreateNpc(nil, "zdwqcsMyinit");
		Char.SetData(zdwqcs_index,%对象_形象%,zdwqcs_pos[5]);
		Char.SetData(zdwqcs_index,%对象_原形%,zdwqcs_pos[5]);
		Char.SetData(zdwqcs_index,%对象_X%,zdwqcs_pos[2]);
		Char.SetData(zdwqcs_index,%对象_Y%,zdwqcs_pos[3]);
		Char.SetData(zdwqcs_index,%对象_地图%,zdwqcs_pos[1]);
		Char.SetData(zdwqcs_index,%对象_方向%,zdwqcs_pos[4]);
		Char.SetData(zdwqcs_index,%对象_原名%,zdwqcs_pos[6]);
		NLG.UpChar(zdwqcs_index);
		Char.SetWindowTalkedEvent(nil,"zdwqcsTalked",zdwqcs_index);
		Char.SetTalkedEvent(nil,"zdwqcsMsg",zdwqcs_index);
	end
end

function zdwqcsMsg( _MeIndex, _PlayerIndex,_Mode)

	if(NLG.CheckInFront(_PlayerIndex, _MeIndex, 2) == false and _Mode==nil) then
		return 0;
	end

    str_ChangeWindow = "  请输入要制作的序号\\n  注意:自动制造的装备无法添加宝石，自动制作每次制作10个，请准备好材料\\n\\n"
    str_ChangeWindow = str_ChangeWindow.."  【1制药】\\n"
	str_ChangeWindow = str_ChangeWindow.."  【2料理】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【3造剑】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【4造斧】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【5造枪】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【6造弓】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【7造杖】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【8造投掷武器】\\n";
    str_ChangeWindow = str_ChangeWindow.."  【9造小刀】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【10造头盔】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【11制帽子】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【12制铠】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【13制衣】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【14制袍】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【15制靴】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【16制鞋】\\n"
    str_ChangeWindow = str_ChangeWindow.."  【17造盾】\\n";

	NLG.ShowWindowTalked(_PlayerIndex,11,3,0,str_ChangeWindow,_MeIndex);

end

function zdwqcsTalked(_MeIndex,_PlayerIndex,_seqno,_select,_data)
	
	if ((_select == 1) and (type(tonumber(_data)) == "number")) then

		if ((tonumber(_data) < 0) and (tonumber(_data) > 20)) then
	    	NLG.SystemMessage(_PlayerIndex,"[系统]请正确填写制作编号");
			return;
		end

        if ((_seqno == 0) and (tonumber(_data) == 1)) then
	        local str_ChangeWindow = "  请输入要制作的药品编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1生命力回复药（100）】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2生命力回复药（150）】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3生命力回复药（200）】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4生命力回复药（250）】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5生命力回复药（300）】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6生命力回复药（400）】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7生命力回复药（500）】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8生命力回复药（600）】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9生命力回复药（800）】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10生命力回复药（1000）】\\n";

            NLG.ShowWindowTalked(_PlayerIndex,11,3,1,str_ChangeWindow,_MeIndex);
            return;
	    end

        if ((_seqno == 0) and (tonumber(_data) == 2)) then
	        local str_ChangeWindow = "  请输入要制作的料理编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1蕃茄酱】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2面包】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3蛋包饭】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4法国面包】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5炒面】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6青椒肉丝】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7烧鸡】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8亲子井】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9汉堡】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10星鳗饭团】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11炒面面包】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12寿喜锅】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13咖哩饭】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14韩式泡菜饭】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15螃蟹锅】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16牛排】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17醋饭寿司】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18豪华寿司组】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19鱼翅汤】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20鳖料理】\\n";

            NLG.ShowWindowTalked(_PlayerIndex,11,3,2,str_ChangeWindow,_MeIndex);
            return;
	    end

        if ((_seqno == 0) and (tonumber(_data) == 3)) then
	        local str_ChangeWindow = "  请输入要制作的剑编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1长剑】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2阔剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3突刺剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4火舌剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5面包剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6双手剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7双刃长剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8锁刃剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9格斗剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10长锷剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11猪牙剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12双刃阔剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13巨剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14长军刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15护身短剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16细柄短剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17细刃重剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18钢硬巨剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19青龙刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20曲刀】\\n";

            NLG.ShowWindowTalked(_PlayerIndex,11,3,3,str_ChangeWindow,_MeIndex);
            return;
	    end
		
        if ((_seqno == 0) and (tonumber(_data) == 4)) then
	        local str_ChangeWindow = "  请输入要制作的斧编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1手斧】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2勇气之斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3宽手斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4战斗手斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5格斗手斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6钢斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7长战斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8双刃斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9钩爪斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10阔刃斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11弯月大战斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12大型阔刃斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13大型双刃斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14超大皇帝斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15新月斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16米诺陶斯战斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17薄刃钩爪斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18弯月长柄斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19金属重斧】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20处刑斧】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,4,str_ChangeWindow,_MeIndex);
            return;
	    end
		
        if ((_seqno == 0) and (tonumber(_data) == 5)) then
	        local str_ChangeWindow = "  请输入要制作的枪编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1短矛】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2攻城枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3刺枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4金属枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5长柄弯枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6长柄尖枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7穗枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8双叉戟】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9护卫枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10骑士枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11大砍枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12长尖枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13蝎枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14双刃枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15阔刃枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16东方长刺枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17钩爪枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18原始枪】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19三叉战戟】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20异型枪】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,5,str_ChangeWindow,_MeIndex);
            return;
	    end
		
        if ((_seqno == 0) and (tonumber(_data) == 6)) then
	        local str_ChangeWindow = "  请输入要制作的弓编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1轻型弓】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2威力短弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3短战弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4猎弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5强弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6格斗弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7狙击之弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8超强狙击弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9杀手长弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10冲击弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11巨弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12长格斗弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13破邪长弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14月光之弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15原始石弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16重弦弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17平行弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18灵魂之弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19摘星之弓】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20魔弹】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,6,str_ChangeWindow,_MeIndex);
            return;
	    end
		
        if ((_seqno == 0) and (tonumber(_data) == 7)) then
	        local str_ChangeWindow = "  请输入要制作的杖编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1短杖】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2权杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3大地之杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4激流权杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5魔之手杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6魔之权杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7贤者手杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8贤者权杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9琥珀杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10琥珀权杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11元素之杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12神圣之杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13怒音之杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14隐者之杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15光明短杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16恶魔之杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17太阳短杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18天使之杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19圣者之杖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20星屑短杖】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,7,str_ChangeWindow,_MeIndex);
            return;
	    end

        if ((_seqno == 0) and (tonumber(_data) == 8)) then
	        local str_ChangeWindow = "  请输入要制作的回力镖编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1木制大型回力镖】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2青铜回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3追迹者】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4彩光回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5暗杀回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6杀敌回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7狮子回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8锐角回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9翼鹿回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11蛇狮回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12鸫回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13熊翼回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14闪光回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15凶豹回力镳】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16赤狮回力镳】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17天使之翼】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18普利辛回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19治愈回力镖】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20天秤回力镖】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,8,str_ChangeWindow,_MeIndex);
            return;
	    end

        if ((_seqno == 0) and (tonumber(_data) == 9)) then
	        local str_ChangeWindow = "  请输入要制作的小刀编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1小刀】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2锐刃小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3圆盘小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4细刃掷刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5滑翔小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6细直刃小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7耳柄小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8骑士小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9球锷小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10双刃小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11阔刃小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12触角小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13汉拉堤小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14凶杀刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15切肉小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16古传小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17华丽小刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18手里剑】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19勾爪掷刀】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20幻之匕首】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,9,str_ChangeWindow,_MeIndex);
            return;
	    end

        if ((_seqno == 0) and (tonumber(_data) == 10)) then
	        local str_ChangeWindow = "  请输入要制作的头盔编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1硬皮头盔】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2铜制头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3铁板布盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4铜铁皮盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5金属护额】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6铁制头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7霸葛头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8角饰头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9开放式头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10葛理克头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11巴比克头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12利刃头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13骑士头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14钢制头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15博流盖尔头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16铆钉头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17羽毛头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18龙盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19白金头盔】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20圣龙头盔】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,10,str_ChangeWindow,_MeIndex);
            return;
	    end
		
        if ((_seqno == 0) and (tonumber(_data) == 11)) then
	        local str_ChangeWindow = "  请输入要制作的帽子编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1麻布帽】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2硬帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3轻帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4皮帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5硬皮帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6可爱的帽子】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7时髦帽子】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8鸭舌帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9蓝徽章之帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10高级帽子】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11装饰着花的帽子】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12青铜帽子】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13淑女帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14可爱的扁帽子】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15军帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16时髦避暑帽子】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17羽毛帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18魔术师之帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19黄昏之帽】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20妖精之帽】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,11,str_ChangeWindow,_MeIndex);
            return;
	    end
		
        if ((_seqno == 0) and (tonumber(_data) == 12)) then
	        local str_ChangeWindow = "  请输入要制作的铠甲编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1软皮甲】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2护心甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3青铜铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4轻型铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5轻型锁炼甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6环甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7钢铁铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8金属皮甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9长型金属铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10索状铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11重铁板甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12铁板半身甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13实战铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14黄金铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15重金属铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16野兽铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17帝王之铠】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18亡灵铠甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19漆黑之铠】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20骑士铠甲】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,12,str_ChangeWindow,_MeIndex);
            return;
	    end
		
        if ((_seqno == 0) and (tonumber(_data) == 13)) then
	        local str_ChangeWindow = "  请输入要制作的衣服编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1旅人之服】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2保护衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3羽毛装】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4皮装】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5硬皮服】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6锁炼装】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7布甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8榇甲】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9环服】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10士兵护衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11长索锥衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12索锥上衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13超级衣服】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14骨衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15疾风之衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16步兵战衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17勇者之衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18女神之衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19不死鸟之服】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20灵魂之服】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,13,str_ChangeWindow,_MeIndex);
            return;
	    end

        if ((_seqno == 0) and (tonumber(_data) == 14)) then
	        local str_ChangeWindow = "  请输入要制作的袍编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1羽毛袍】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2轻皮袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3网袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4风袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5硬皮袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6环袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7乌鸦之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8月亮之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9东方法衣】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10圣堂之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11圣者之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12战斗长袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13冠军之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14时之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15死神之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16勇者之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17黑暗之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18圣袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19灵魂之袍】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20奇迹之袍】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,14,str_ChangeWindow,_MeIndex);
            return;
	    end

        if ((_seqno == 0) and (tonumber(_data) == 15)) then
	        local str_ChangeWindow = "  请输入要制作的靴编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1软皮靴】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2皮靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3硬皮靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4长靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5厚底靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6编织的靴子】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7锁炼长靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8锁炼靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9蜥蜴靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10蜥蜴长靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11钢靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12钢制长靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13水晶靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14银靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15流水之靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16芙蕾雅之靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17钻石靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18钻石长靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19秘密之靴】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20龙之靴】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,15,str_ChangeWindow,_MeIndex);
            return;
	    end

        if ((_seqno == 0) and (tonumber(_data) == 16)) then
	        local str_ChangeWindow = "  请输入要制作的鞋编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1运动鞋】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2马车鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3皮鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4安全鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5光之鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6战鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7薄板鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8锁炼鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9蜥蜴鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10维京鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11战斗鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12骑士鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13妖精鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14紫水晶鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15白金鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16精致高级鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17神秘之鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18力量之鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19黄金鞋】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20龙之鞋】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,16,str_ChangeWindow,_MeIndex);
            return;
	    end

        if ((_seqno == 0) and (tonumber(_data) == 17)) then
	        local str_ChangeWindow = "  请输入要制作的盾编号\\n"
            str_ChangeWindow = str_ChangeWindow.."  【1小圆盾】\\n"
		    str_ChangeWindow = str_ChangeWindow.."  【2小型盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【3板盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【4鸢盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【5漩涡重盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【6哥特盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【7士兵盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【8重盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【9蜥蜴盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【10反光之盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【11风之盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【12狮子盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【13防守之盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【14黄金之盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【15镜之盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【16力量之盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【17漆黑之盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【18火龙之盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【19黑暗之盾】\\n"
            str_ChangeWindow = str_ChangeWindow.."  【20勇者之盾】\\n";

		    NLG.ShowWindowTalked(_PlayerIndex,11,3,17,str_ChangeWindow,_MeIndex);
            return;
	    end
		
        if ((_seqno == 1) and (tonumber(_data) ~= "")) then
		    local scbh = tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,216)
		    return;
		end

        if ((_seqno == 2) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,215)
		    return;
		end

        if ((_seqno == 3) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,200)
		    return;
		end

        if ((_seqno == 4) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,201)
		    return;
		end

        if ((_seqno == 5) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,202)
		    return;
		end

        if ((_seqno == 6) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,203)
		    return;
		end

        if ((_seqno == 7) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,204)
		    return;
		end

        if ((_seqno == 8) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,205)
		    return;
		end

        if ((_seqno == 9) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,206)
		    return;
		end

        if ((_seqno == 10) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,207)
		    return;
		end

        if ((_seqno == 11) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,208)
		    return;
		end

        if ((_seqno == 12) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,209)
		    return;
		end

        if ((_seqno == 13) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,210)
		    return;
		end

        if ((_seqno == 14) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,211)
		    return;
		end

        if ((_seqno == 15) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,212)
		    return;
		end

        if ((_seqno == 16) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,213)
		    return;
		end

        if ((_seqno == 17) and (tonumber(_data) ~= "")) then
		    local scbh = (_seqno * 20) - 30 + tonumber(_data)
		    zdwqcsgndf(_PlayerIndex,scbh,214)
		    return;
		end
	end
end

function zdwqcsgndf(player,scbh2,jn2)
    local dxzy = Char.GetData(player,%对象_职业%)
 
	if (dxzy < zdwqcs_zy[1] or dxzy > zdwqcs_zy[2]) then
		NLG.SystemMessage(player,"[系统]只有制作系职业才能使用");
		return;
	end

    local jcsskw = Char.FindEmptyItemBox(player);
    if (jcsskw < zdwqcs_zzsl) then
		NLG.SystemMessage(player,"[系统]背包无空间，无法制作");
		return;
	end
   
    local ckssmb = Char.GetData(player,%对象_金币%)
    local zhsxf = zdwqcs_zzjg * zdwqcs_zzsl

    if zhsxf > 0 and ckssmb < zhsxf then
		NLG.SystemMessage(player,"[系统]手续费不够");
		return;
	end	

	local ckzjjn = Char.HaveSkill(player,jn2)

	if (ckzjjn < 0) then
		NLG.SystemMessage(player,"[系统]生产技能等级不够，无法生产");
		return;
	end
    local ckzjjndj = Char.GetSkillLevel(player,ckzjjn)

	if (ckzjjndj < zzwpid[scbh2][#zzwpid[scbh2]]) then
		NLG.SystemMessage(player,"[系统]生产技能等级不够，无法生产");
		return;
	end

	local cyjg = (#zzwpid[scbh2] / 3) - 1
	
	for i = 1,cyjg do
		local cxjg = Char.FindItemId(player,zzwpid[scbh2][(i*3)-1])

		if (cxjg <= 0) then
			NLG.SystemMessage(player,"[系统]缺少制作的材料");
	        return;
		end
			
		local cxclsl = Char.ItemNum(player,zzwpid[scbh2][(i*3)-1])
		local zhclsl = zdwqcs_zzsl * zzwpid[scbh2][i*3]

		if (cxclsl < zhclsl) then
			NLG.SystemMessage(player,"[系统]制作的材料数量不够");
	        return;
		end
	end

	if ckzjjndj < 10 then
		local zdwqcs_jnjy = 0;
		if zdwqcs_jy[jn2] then
			zdwqcs_jnjy = zdwqcs_jy[jn2];
		end
		local zhjyy = zdwqcs_zzsl * zdwqcs_jnjy
		if zhjyy > 0 then
			Char.Setskillexp(player, ckzjjn, zhjyy);
			NLG.UpChar(player);
		end
	end
		
	for z = 1,cyjg do
		local scsl = zzwpid[scbh2][z*3] * zdwqcs_zzsl
        NLG.DelItem(player,zzwpid[scbh2][(z*3)-1],scsl)
	end
        
	local wqid = zzwpid[scbh2][#zzwpid[scbh2]-1]

    if (scbh2 >= 31) then

		for v = 1,zdwqcs_zzsl do
			local gddjdex = Char.GiveItem(player,wqid,1);
			Item.SetData(gddjdex, %道具_已鉴定%, 1);
		end
		Item.UpItem(player,-1)
		if zhsxf > 0 then
			Char.SetData(player,%对象_金币%,ckssmb - zhsxf)
			NLG.SystemMessage(player,"[系统]制作完毕，扣除手续费"..zhsxf.."G");
		else
			NLG.SystemMessage(player,"[系统]制作完毕.");
		end
		NLG.UpChar(player);
		return;
	end

    if (scbh2 <= 30) then

		Char.GiveItem(player,wqid,zdwqcs_zzsl);
		if zhsxf > 0 then
			Char.SetData(player,%对象_金币%,ckssmb - zhsxf)
			NLG.SystemMessage(player,"[系统]制作完毕，扣除手续费"..zhsxf.."G");
		else
			NLG.SystemMessage(player,"[系统]制作完毕.");
		end
		NLG.UpChar(player);
		return;
	end
	
    return;
end

function zdwqcs_Init()
	zdwqcs = nil;
	initzdwqcsNpc();
end
