
--[[
属性列表:
生命
魔法			
防御
攻击
敏捷
精神
恢复				
抗毒
抗睡
抗石
抗醉
抗混
抗遗
必杀
反击
命中
闪避
魔攻
魔抗
速度

种族

物伤
魔伤
物抵
魔抵
暴击 这个是几率 数量达到 100 为百分比出

魔减
窗口命令:[#ChiBang]
--]]

--翅膀形象编号,119001~119023

ChiBangTable = {} -- 翅膀明细

ChiBangTable["彩虹之翼"] = {}
-- 翅膀形象编号，{材料名字，材料图档，数量，材料物品ID}，{升级的属性}
ChiBangTable["彩虹之翼"][1] = {119007,{"彩虹之羽",1002654,1,805000},{ "生命|1000","魔法|1000","攻击500","敏捷|500","防御|500"}}

-- 继续定义翅膀数据表
ChiBangTable["极夜之翼"] = {}
ChiBangTable["极夜之翼"][1] = {119013, {"极夜之羽", 1002664, 1, 805010}, {"生命|20000", "魔法|20000", "攻击10000", "敏捷|10000", "防御|10000"}}

ChiBangTable["幽灵之翼"] = {}
ChiBangTable["幽灵之翼"][1] = {119014, {"幽灵之羽", 1002665, 1, 805011}, {"生命|25000", "魔法|25000", "攻击12500", "敏捷|12500", "防御|12500"}}

ChiBangTable["幻影之翼"] = {}
ChiBangTable["幻影之翼"][1] = {119015, {"幻影之羽", 1002666, 1, 805012}, {"生命|30000", "魔法|30000", "攻击15000", "敏捷|15000", "防御|15000"}}

ChiBangTable["时光之翼"] = {}
ChiBangTable["时光之翼"][1] = {119016, {"时光之羽", 1002667, 1, 805013}, {"生命|35000", "魔法|35000", "攻击17500", "敏捷|17500", "防御|17500"}}

ChiBangTable["深渊之翼"] = {}
ChiBangTable["深渊之翼"][1] = {119017, {"深渊之羽", 1002668, 1, 805014}, {"生命|40000", "魔法|40000", "攻击20000", "敏捷|20000", "防御|20000"}}

ChiBangTable["混沌之翼"] = {}
ChiBangTable["混沌之翼"][1] = {119021, {"混沌之羽", 1002672, 1, 805018}, {"生命|60000", "魔法|60000", "攻击30000", "敏捷|30000", "防御|30000"}}

ChiBangTable["永恒之翼"] = {}
ChiBangTable["永恒之翼"][1] = {119022, {"永恒之羽", 1002673, 1, 805019}, {"生命|65000", "魔法|65000", "攻击32500", "敏捷|32500", "防御|32500"}}

-- 定义翅膀数据表
ChiBangTable["光明之翼"] = {}
ChiBangTable["光明之翼"][1] = {119008, {"光明之羽", 1002659, 1, 805005}, {"生命|4000", "魔法|4000", "攻击2500", "敏捷|2500", "防御|2500"}}

ChiBangTable["暗影之翼"] = {}
ChiBangTable["暗影之翼"][1] = {119009, {"暗影之羽", 1002660, 1, 805006}, {"生命|6000", "魔法|6000", "攻击3000", "敏捷|3000", "防御|3000"}}

ChiBangTable["星辰之翼"] = {}
ChiBangTable["星辰之翼"][1] = {119010, {"星辰之羽", 1002661, 1, 805007}, {"生命|8000", "魔法|8000", "攻击4000", "敏捷|4000", "防御|4000"}}

ChiBangTable["风暴之翼"] = {}
ChiBangTable["风暴之翼"][1] = {119011, {"风暴之羽", 1002662, 1, 805008}, {"生命|12000", "魔法|12000", "攻击6000", "敏捷|6000", "防御|6000"}}

ChiBangTable["神圣之翼"] = {}
ChiBangTable["神圣之翼"][1] = {119012, {"神圣之羽", 1002663, 1, 805009}, {"生命|15000", "魔法|15000", "攻击7500", "敏捷|7500", "防御|7500"}}
