
--[[
属性列表:
生命
魔法			
防御
攻击
敏捷
精神
恢复				
抗毒
抗睡
抗石
抗醉
抗混
抗遗
必杀
反击
命中
闪避
魔攻
魔抗
速度

种族

物伤
魔伤
物抵
魔抵
暴击 这个是几率 数量达到 100 为百分比出

魔减
窗口命令:[#ChiBang]
--]]

--翅膀形象编号,119001~119023

ChiBangTable = {} -- 翅膀明细

ChiBangTable["烈焰之翼"] = {}  
-- 翅膀形象编号，{材料名字，材料图档，数量，材料物品ID}，{升级的属性}
ChiBangTable["烈焰之翼"][1] = {119007,{"烈焰之羽",1002654,1,805000},{ "生命|1000","魔法|1000","攻击500","敏捷|500","防御|500"}}

ChiBangTable["魔龙之翼"] = {}
ChiBangTable["魔龙之翼"][1] = {119004,{"天使之羽",1002655,1,805001},{ "生命|2000","魔法|2000","攻击1000","敏捷|1000","防御|1000"}}

ChiBangTable["天使之翼"] = {}
ChiBangTable["天使之翼"][1] = {119001,{"魔龙之羽",1002656,1,805002},{ "生命|3000","魔法|3000","攻击1500","敏捷|1500","防御|1500"}}

ChiBangTable["精灵之翼"] = {}
ChiBangTable["精灵之翼"][1] = {119003,{"精灵之羽",1002657,1,805003},{ "生命|5000","魔法|5000","攻击2000","敏捷|2000","防御|2000"}}

ChiBangTable["地狱之翼"] = {}
ChiBangTable["地狱之翼"][1] = {119006,{"地狱之羽",1002658,1,805004},{ "生命|10000","魔法|10000","攻击5000","敏捷|5000","防御|5000"}}









