


--[[  
20230222更新 修正连战
脚本说明：
 根据宠物enemybaseid 赋予怪物特殊属性，避免base配置的繁琐和设置BP 照成的连锁影响
 例如 血量50000000 设置后 攻击也会增加的问题

 注意 赋予的怪 如果可以捕捉会属性异常
---------------------------------------
---------------属性列表----------------
---------------------------------------
防御
攻击
敏捷
精神
回复
生命
魔法
抗毒
抗睡
抗石
抗醉
抗混
抗遗
必杀
反击
命中
闪躲
魔攻
魔抗
--]]


EnemyExtension_s = {}
--EnemyExtension_s[7030] = {"生命|100000" } --EnemyExtension_s[enemybaseid] = {"生命|15000" }


------------------------------------------------------------------------------------------------------------------------------

