


--[[  
脚本说明：
 根据宠物名字 赋予怪物特殊属性，避免base配置的繁琐和设置BP 照成的连锁影响
 例如 血量50000000 设置后 攻击也会增加的问题

 注意 赋予的怪 如果可以捕捉会属性异常
 支持连战
---------------------------------------
---------------属性列表----------------
---------------------------------------
防御
攻击
敏捷
精神
回复
生命
魔法
抗毒
抗睡
抗石
抗醉
抗混
抗遗
必杀
反击
命中
闪躲
魔攻
魔抗
--]]


EnemyExtension = {}
--EnemyExtension["enemybase名字"] = {"属性" } 
EnemyExtension["魔无.练气"] = {"生命|15000" } 
EnemyExtension["魔无.筑基"] = {"生命|25000","攻击|300" } 
EnemyExtension["物无.金丹"] = {"生命|25000" } 
EnemyExtension["魔无.元婴"] = {"生命|25000","攻击|500" } 
EnemyExtension["魔无.化神"] = {"生命|35000","攻击|500" } 
EnemyExtension["魔无.大乘"] = {"生命|35000","攻击|500" } 
EnemyExtension["暗夜.飞仙"] = {"生命|80000" } 
EnemyExtension["暗夜.渡劫"] = {"生命|60000" } 
EnemyExtension["魔无.仙人"] = {"生命|40000","攻击|700" } 
EnemyExtension["物无.金仙"] = {"生命|35000","攻击|700" } 
EnemyExtension["魔无.仙君"] = {"生命|45000","攻击|1000" } 
EnemyExtension["魔无.仙帝"] = {"生命|95000","攻击|1500" } 





------------------------------------------------------------------------------------------------------------------------------
