
Login_MaxPlayer_PC = 999 --总窗口
Login_MaxPlayer_PC_zhandou = 999 --战斗窗口
Login_MaxPlayer_PC_shengchan = 999 --生产窗口
Login_Num = 10--原地次数
Login_ls_table = {}
Login_ls_table1 = {}
战斗职业表 = {
	10,20,30,40,50,60,70,80,90,100,110,130,140,150,160,170,180,190
};
生产职业表 = {
	120,200,210,220,230,240,250,260,270,280,290,300,310,320,330,340,350,360,370,380,390,400,410,420,430,440,450,460,470,480
};
Login_ls_logmsg =  "\n\n$1 欢迎您来到11111111111111$0\n\n$3 宠物丢地消失时间:75小时，物品魔币丢地消失时间:10分钟$0\n\n$4 F1:调整自动战斗,111111111111111111\n F2:开启/关闭自动战斗，F3:设定自动寻路，F4:开启/关闭自动寻路\n 2222222222222222222222\n\n33333333333333333333333$0 "


-------------------------------------------------------------------------------------------------
using("GE_Sys_Login",true)