

-- 脚本说明 
-- BY.SG

-- 本脚本结合了 宠物自售 和 宠物贩卖(镜像摆摊) 

-- 可一键续期，且服务器重启后无需重新设置  支持双货币

-- 自售宠物 到期后 会自动传送至 宠物走失中心 并保留 SG_pet_Shop.服务器设定宠物删除时间 的时间

-- 宠物贩卖（镜像贩卖） 同样支持双货币
--其他可见脚本
-------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------

SG_pet_Shop ={}
SG_pet_Shop.prohibit_name ={' ','~','sb','SB','gm','GM','Gm','家','你妈','逼','艹','操','傻','族','服','草','自贩售','售','自','贩'}; --禁止对宠物起名字
SG_pet_Shop.prohibit_Pet = {'哥布林','迷你蝙蝠','新手螳螂','小蝙蝠','使魔','拉布拉多','二哈'}-- 禁止丢地宠物 小于20级丢地就会消失
SG_pet_Shop.DiyStall = {"m","j"};--设置宠物出售特征 (宠物名字改为m数字j数字 丢出即可比如m500j5)
SG_pet_Shop.DiyName = {"魔币","金卡"};
SG_pet_Shop.DiyItemID = 29999; --金卡编号
SG_pet_Shop.DiyItemMax = 9999;--金卡最大叠加
SG_pet_Shop.DiyStallMap = {1000};--只允许在哪些地图进行自售
SG_pet_Shop.DiyStallGooldMax = 9999999;--魔币最高上限
SG_pet_Shop.DiyStallLevel = 1;--设置最高几级宠物能进行自售
SG_pet_Shop.SloganY = "￥"  -- 不建议修改
SG_pet_Shop.SloganM = "＄"  -- 不建议修改 
SG_pet_Shop.Ban_map = {1000,0,0,0,0}  -- 禁止摆放宠物地图坐标（范围坐标）
SG_pet_Shop.AutomaticCharge = 100 --自动延期价格
SG_pet_Shop.Gold_Pet = 100    --宠物延期价格（与npc对话）
SG_pet_Shop.NpcName = "镜像自售管理员"					--Npc名称（同时也是脚本名称）
SG_pet_Shop.NpcMapPos = {0,1000,0,0}				--Npc地图坐标
SG_pet_Shop.NpcImage = 101022					--Npc图档101022
SG_pet_Shop.NpcDir = 6								--Npc方向（0为左上，顺时针转）


SG_pet_Shop.Petloyalty = 429-- 特殊 不要修改
-------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------
SG_pet_Shop.宠物自售删除时间 = 3500  -- 自售 秒 一定要小于 setup.cf  Petdeletetime 宠物删除时间
SG_pet_Shop.普通宠物删除时间 = 3000   -- 普通 秒 一定要小于 setup.cf  Petdeletetime 宠物删除时间

