



StrongTable = {}
--[[
物伤  --增加物理伤害
魔伤  -- 增加魔法伤害
暴击  -- 照成的伤害有几率 触发  魔法伤害也可以触发

物抵  -- 减少物理伤害
魔抵  -- 减少魔法伤害
暴减  -- PVP 时用于减少 攻击方的 暴击几率     -- Boss 战 减少 boss 的必杀伤害

--]]


StrongTable.ImageFixed = {} -- 增加固定伤害
--StrongTable.ImageFixed[形象编号] = 
StrongTable.ImageFixed[100000] = 100

StrongTable.ImageBest = {}  -- 增加百分比伤害
--StrongTable.ImageBest[形象编号] 
StrongTable.ImageBest[101000] = 100




StrongTable.Skill = {19,20,21,22,23,24,25,26,27,28,29,30,31} -- 魔法技能
StrongTable.magic = 100   -- 100 等于  1000/303 精神释放魔法时增加3.3 倍
StrongTable.magicBoss = 1   --魔法修正伤害释放适用于boss
StrongTable.crit = 150 -- %暴击伤害倍率   150  = 伤害百分之 150%
StrongTable.Boss = 15   -- 当Boss 攻击触发必杀时 且 触发暴减几率  减少必杀伤害比例

StrongTable.attribute = {}
StrongTable.attribute[1] = {   -- 头
-- Item 内 升级需要的道具 道具ID ,数量     Damage 增加伤害 注意  抵属性超过99% 后受到的伤害为1     
{Item = {{4051,10,"这是说明,号换行"},{9612,20},{9613,30,"这是说明,号换行"}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{4051,10,"这是说明,号换行"},{9615,20,"这是说明,号换行"},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}

StrongTable.attribute[2] = {   -- 身
{Item = {{9611,10},{9612,20},{9613,30}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}


StrongTable.attribute[3] = {   -- 左手
{Item = {{9611,10},{9612,20},{9613,30}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}


StrongTable.attribute[4] = {   -- 右手
{Item = {{9611,10},{9612,20},{9613,30}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}

StrongTable.attribute[5] = {   -- 腿
{Item = {{9611,10},{9612,20},{9613,30}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}

StrongTable.attribute[6] = {   -- 首饰1
{Item = {{9611,10},{9612,20},{9613,30}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}

StrongTable.attribute[7] = {   -- 首饰2
{Item = {{9611,10},{9612,20},{9613,30}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}

StrongTable.attribute[8] = {   -- 水晶
{Item = {{9611,10},{9612,20},{9613,30}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}


--------------------------------------------------------------------------------------------------------------------------------------
StrongTable.Petattribute = {}
StrongTable.Petattribute[1] = {   
-- Item 内 升级需要的道具 道具ID ,数量     Damage 增加伤害 注意  抵属性超过99% 后受到的伤害为1     
{Item = {{4051,10,"这是说明2,号换行"},{9612,20},{9613,30,"这是说明,号换行"}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{4051,10,"这是说明,号换行"},{9615,20,"这是说明,号换行"},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}

StrongTable.Petattribute[2] = {   
{Item = {{9611,10},{9612,10},{9613,10}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}


StrongTable.Petattribute[3] = {   
{Item = {{9611,10},{9612,20},{9613,30}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}


StrongTable.Petattribute[4] = {   
{Item = {{9611,10},{9612,20},{9613,30}} , Damage = {"物伤|10","魔伤|11","暴击|12","物抵|13","魔抵|14","暴减|15"}},
{Item = {{9614,10},{9615,20},{9616,30}} , Damage = {"物伤|20","魔伤|21","暴击|22","物抵|23","魔抵|24","暴减|25"}},
}





---------------------------------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------------------------------