 
-- 形象
-- 本脚本 
--[[
说明: 
	形象 形象编号（如果 多个武器 或颜色 只需填写第一编号即可）
	武器 这个形象拥有的武器数量 （单一形象 填写1）
	颜色 拥有的颜色数量 （单一形象 填写1）
	本脚本会自动根据 武器和颜色 自动排列形象编号，避免繁琐的操作。
	注意：多武器 颜色 必须 形象编号连续 否则会出现bug
	注意：多武器 颜色 必须 形象编号连续 否则会出现bug
	注意：多武器 颜色 必须 形象编号连续 否则会出现bug
--]]

ImageTable = {}

ImageTable.proportion = 1   -- 比例衣橱内为使用的形象增加的比例


ImageTable.Char = {   -- 人物形象
    -- GM形象
    {形象 = 100450, 武器 = 6, 颜色 = 1 ,Item = {20113,50}},
    {形象 = 100450, 武器 = 6, 颜色 = 1 ,Item = {20113,50}},
    {形象 = 100475, 武器 = 6, 颜色 = 1 ,Item = {20113,50}},
    {形象 = 100500, 武器 = 6, 颜色 = 1 ,Item = {20113,50}},
    {形象 = 105712, 武器 = 6, 颜色 = 1 ,Item = {20113,50}},

    --白色形象
    {形象 = 100972, 武器 = 6, 颜色 = 1 ,Item = {20114,50}},
    {形象 = 100978, 武器 = 6, 颜色 = 1 ,Item = {20114,50}},
    {形象 = 100984, 武器 = 6, 颜色 = 1 ,Item = {20114,50}},
    {形象 = 100990, 武器 = 6, 颜色 = 1 ,Item = {20114,50}},
    {形象 = 105700, 武器 = 6, 颜色 = 1 ,Item = {20114,50}},

    --灰色形象
    {形象 = 100537, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},
    {形象 = 100631, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},
    {形象 = 100768, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},
    {形象 = 100774, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},
    {形象 = 105206, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},
    {形象 = 105218, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},
    {形象 = 105224, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},
    {形象 = 105442, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},
    {形象 = 105460, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},
    {形象 = 105466, 武器 = 6, 颜色 = 1 ,Item = {20115,50}},

    --黑色形象
    {形象 = 100888, 武器 = 6, 颜色 = 1 ,Item = {20116,50}},
    {形象 = 105973, 武器 = 6, 颜色 = 1 ,Item = {20116,50}},
    {形象 = 108151, 武器 = 1, 颜色 = 1 ,Item = {20116,50}},
    {形象 = 100575, 武器 = 6, 颜色 = 1 ,Item = {20116,50}},
    {形象 = 100650, 武器 = 6, 颜色 = 1 ,Item = {20116,50}},
    {形象 = 100924, 武器 = 6, 颜色 = 1 ,Item = {20116,50}},
    {形象 = 105979, 武器 = 6, 颜色 = 1 ,Item = {20116,50}},
    {形象 = 100600, 武器 = 6, 颜色 = 1 ,Item = {20116,50}},
    {形象 = 100942, 武器 = 6, 颜色 = 1 ,Item = {20116,50}},
    {形象 = 100700, 武器 = 6, 颜色 = 1 ,Item = {20116,50}},

    --彩色形象
    {形象 = 100930, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 100937, 武器 = 5, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 100187, 武器 = 5, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 100543, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 100792, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105478, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105676, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 100762, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 100786, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 100949, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},

    {形象 = 106192, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 106186, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 106224, 武器 = 4, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 106241, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 106706, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 106793, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 119330, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105156, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105176, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105182, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},

    {形象 = 105212, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105430, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105490, 武器 = 4, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105603, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105610, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105640, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105748, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105754, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105800, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105812, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},

    {形象 = 105824, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105901, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105907, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105913, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105937, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105955, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 105961, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 106331, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 106768, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},
    {形象 = 106787, 武器 = 6, 颜色 = 1 ,Item = {20117,50}},

    --精灵形象
    {形象 = 110350, 武器 = 6, 颜色 = 1 ,Item = {20118,50}},
    {形象 = 110356, 武器 = 6, 颜色 = 1 ,Item = {20118,50}},
    {形象 = 110362, 武器 = 6, 颜色 = 1 ,Item = {20118,50}},
    {形象 = 110368, 武器 = 6, 颜色 = 1 ,Item = {20118,50}},
    {形象 = 106708, 武器 = 1, 颜色 = 1 ,Item = {20118,50}},
    {形象 = 106706, 武器 = 1, 颜色 = 1 ,Item = {20118,50}},
    {形象 = 106707, 武器 = 1, 颜色 = 1 ,Item = {20118,50}},
    {形象 = 108312, 武器 = 1, 颜色 = 1 ,Item = {20118,50}},
    {形象 = 100996, 武器 = 1, 颜色 = 1 ,Item = {20118,50}},
    {形象 = 105900, 武器 = 1, 颜色 = 1 ,Item = {20118,50}},

    --石器
    {形象 = 100860, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 116230, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100859, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100861, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100864, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100865, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100866, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100867, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100870, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 116022, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},

    --特殊
    {形象 = 100199, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100921, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100936, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 105993, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 105994, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100895, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100896, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 100897, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 101130, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 101131, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 101136, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 101140, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 101141, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 101142, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 101143, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 108310, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 108311, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 108315, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 108316, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 108321, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 119500, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 119538, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 119539, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 119540, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 119562, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
    {形象 = 119999, 武器 = 1, 颜色 = 1 ,Item = {20112,50}},
}

ImageTable.Pet = {   -- 宠物形象
    --{形象 = 117020, 颜色 = 1 ,Item = {29999,50}},
}


ImageTable.Attribute = {}

----人物

ImageTable.Attribute[100450] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}
ImageTable.Attribute[100450] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}
ImageTable.Attribute[100475] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}
ImageTable.Attribute[100500] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}
ImageTable.Attribute[105712] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}
ImageTable.Attribute[100972] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}
ImageTable.Attribute[100978] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}
ImageTable.Attribute[100984] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}
ImageTable.Attribute[100990] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}
ImageTable.Attribute[105700] = {"攻击|50","防御|30","敏捷|30","生命|50", "魔法|50","精神|10","恢复|10"}

ImageTable.Attribute[100537] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}
ImageTable.Attribute[100631] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}
ImageTable.Attribute[100768] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}
ImageTable.Attribute[100774] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}
ImageTable.Attribute[105206] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}
ImageTable.Attribute[105218] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}
ImageTable.Attribute[105224] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}
ImageTable.Attribute[105442] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}
ImageTable.Attribute[105460] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}
ImageTable.Attribute[105466] = {"攻击|70","防御|36","敏捷|36","生命|80", "魔法|60","精神|13","恢复|13"}

ImageTable.Attribute[100888] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}
ImageTable.Attribute[105973] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}
ImageTable.Attribute[108151] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}
ImageTable.Attribute[100575] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}
ImageTable.Attribute[100650] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}
ImageTable.Attribute[100924] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}
ImageTable.Attribute[105979] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}
ImageTable.Attribute[100600] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}
ImageTable.Attribute[100942] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}
ImageTable.Attribute[100700] = {"攻击|80","防御|40","敏捷|40","生命|90", "魔法|60","精神|15","恢复|15"}

ImageTable.Attribute[100930] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[100937] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[100187] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[100543] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[100792] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105478] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105676] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[100762] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[100786] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[100949] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}

ImageTable.Attribute[106192] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[106186] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[106224] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[106241] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[106706] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[106793] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[119330] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105156] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105176] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105182] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}

ImageTable.Attribute[105212] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105430] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105490] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105603] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105610] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105640] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105748] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105754] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105800] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105812] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}

ImageTable.Attribute[105824] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105901] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105907] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105913] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105937] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105955] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[105961] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[106331] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[106768] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}
ImageTable.Attribute[106787] = {"攻击|100","防御|49","敏捷|48","生命|99", "魔法|66","精神|16","恢复|16"}

ImageTable.Attribute[100860] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}
ImageTable.Attribute[116230] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}
ImageTable.Attribute[100859] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}
ImageTable.Attribute[100861] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}
ImageTable.Attribute[100864] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}
ImageTable.Attribute[100865] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}
ImageTable.Attribute[100866] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}
ImageTable.Attribute[100867] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}
ImageTable.Attribute[100870] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}
ImageTable.Attribute[116022] = {"攻击|130","防御|58","敏捷|56","生命|111", "魔法|99","精神|21","恢复|21"}

ImageTable.Attribute[100199] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[100921] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[100936] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[105993] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[105994] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[100895] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[100896] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[100897] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[101130] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[101131] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[101136] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[101140] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[101141] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[101142] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[101143] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[108310] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[108311] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[108315] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[108316] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[108321] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[119500] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[119538] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[119539] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[119540] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[119562] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}
ImageTable.Attribute[119999] = {"攻击|150","防御|69","敏捷|66","生命|133", "魔法|111","精神|28","恢复|28"}

---宠物
--ImageTable.Attribute[117020] = {"攻击|50","防御|50","敏捷|50","生命|50"}

ImageTable.T = {} -- 设置宠物形象提取后的给与道具的 id 数量
--ImageTable.T[117020] = {29999, 1}

ImageTable.CT = {}-- 设置人物形象提取后的给与道具的 id 数量
--ImageTable.T[104843] = {29999, 1}

