 
-- ĞÎÏó
-- ±¾½Å±¾ 
--[[
ËµÃ÷: 
	ĞÎÏó ĞÎÏó±àºÅ£¨Èç¹û ¶à¸öÎäÆ÷ »òÑÕÉ« Ö»ĞèÌîĞ´µÚÒ»±àºÅ¼´¿É£©
	ÎäÆ÷ Õâ¸öĞÎÏóÓµÓĞµÄÎäÆ÷ÊıÁ¿ £¨µ¥Ò»ĞÎÏó ÌîĞ´1£©
	ÑÕÉ« ÓµÓĞµÄÑÕÉ«ÊıÁ¿ £¨µ¥Ò»ĞÎÏó ÌîĞ´1£©
	±¾½Å±¾»á×Ô¶¯¸ù¾İ ÎäÆ÷ºÍÑÕÉ« ×Ô¶¯ÅÅÁĞĞÎÏó±àºÅ£¬±ÜÃâ·±ËöµÄ²Ù×÷¡£
	×¢Òâ£º¶àÎäÆ÷ ÑÕÉ« ±ØĞë ĞÎÏó±àºÅÁ¬Ğø ·ñÔò»á³öÏÖbug
	×¢Òâ£º¶àÎäÆ÷ ÑÕÉ« ±ØĞë ĞÎÏó±àºÅÁ¬Ğø ·ñÔò»á³öÏÖbug
	×¢Òâ£º¶àÎäÆ÷ ÑÕÉ« ±ØĞë ĞÎÏó±àºÅÁ¬Ğø ·ñÔò»á³öÏÖbug
--]]

ImageTable = {}

ImageTable.proportion = 1   -- ±ÈÀıÒÂ³÷ÄÚÎªÊ¹ÓÃµÄĞÎÏóÔö¼ÓµÄ±ÈÀı


ImageTable.Char = {   -- ÈËÎïĞÎÏó
{ĞÎÏó = 104843, ÎäÆ÷ = 1, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 104906, ÎäÆ÷ = 1, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 104842, ÎäÆ÷ = 1, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 104905, ÎäÆ÷ = 1, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 105634, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,2000}},
{ĞÎÏó = 105664, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,2000}},
{ĞÎÏó = 100656, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 119312, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 100909, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 105818, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 100924, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 105682, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 100966, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 105754, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 100882, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 119306, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 100200, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 100175, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 105806, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 106200, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 106244, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 100942, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 105506, ÎäÆ÷ = 6, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 101531, ÎäÆ÷ = 1, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 101932, ÎäÆ÷ = 1, ÑÕÉ« = 1 ,Item = {9611,1}},
{ĞÎÏó = 101935, ÎäÆ÷ = 1, ÑÕÉ« = 1 ,Item = {9611,1}},

}

ImageTable.Pet = {   -- ³èÎïĞÎÏó
{ĞÎÏó = 117020, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 110379, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 110308, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 101402, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 106478, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 104875, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 101930, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 101922, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 100625, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 100626, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 100627, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 100628, ÑÕÉ« = 1 ,Item = {9612,1}},
{ĞÎÏó = 100629, ÑÕÉ« = 1 ,Item = {9612,1}},

}


ImageTable.Attribute = {}

----ÈËÎï

ImageTable.Attribute[104843] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[104906] = {"¹¥»÷|5000","·ÀÓù|1200","Ãô½İ|1200","ÉúÃü|5000"}
ImageTable.Attribute[104842] = {"¹¥»÷|7000","·ÀÓù|1500","Ãô½İ|1500","ÉúÃü|7000"}
ImageTable.Attribute[104905] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105634] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105635] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105636] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105637] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105638] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105639] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105664] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105665] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105666] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105667] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105668] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105669] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100656] = {"¹¥»÷|3500","·ÀÓù|1100","Ãô½İ|1100","ÉúÃü|4000"}
ImageTable.Attribute[100657] = {"¹¥»÷|3500","·ÀÓù|1100","Ãô½İ|1100","ÉúÃü|4000"}
ImageTable.Attribute[100658] = {"¹¥»÷|3500","·ÀÓù|1100","Ãô½İ|1100","ÉúÃü|4000"}
ImageTable.Attribute[100659] = {"¹¥»÷|3500","·ÀÓù|1100","Ãô½İ|1100","ÉúÃü|4000"}
ImageTable.Attribute[100660] = {"¹¥»÷|3500","·ÀÓù|1100","Ãô½İ|1100","ÉúÃü|4000"}
ImageTable.Attribute[100661] = {"¹¥»÷|3500","·ÀÓù|1100","Ãô½İ|1100","ÉúÃü|4000"}
ImageTable.Attribute[119312] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[119313] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[119314] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[119315] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[119316] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[119317] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[100909] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[100910] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[100911] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[100912] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[100913] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[100914] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[105818] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[105819] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[105820] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[105821] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[105822] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[105823] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[100924] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100925] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100926] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100927] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100928] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100929] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105682] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105683] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105684] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105685] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105686] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105687] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100966] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100967] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100968] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100969] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100970] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100971] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105754] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105755] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105756] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105757] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105758] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[105759] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100882] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[100883] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[100884] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[100885] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[100886] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[100887] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[105825] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[105826] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[105827] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[105828] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[105829] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[119306] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[119307] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[119308] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[119309] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[119310] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[119311] = {"¹¥»÷|30000","·ÀÓù|4000","Ãô½İ|4000","ÉúÃü|40000"}
ImageTable.Attribute[100200] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100201] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100202] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100203] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100204] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100205] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100175] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100176] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100177] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100178] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100179] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100180] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105806] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105807] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105808] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105809] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105810] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105811] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106200] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106201] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106202] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106203] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106204] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106205] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106243] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106244] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106245] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106246] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106247] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[106248] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100967] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100968] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100969] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100970] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100971] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100942] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100943] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100944] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100945] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100946] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100947] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105506] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105507] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105508] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105509] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105510] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[105511] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[101531] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[101932] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[101935] = {"¹¥»÷|60000","·ÀÓù|8000","Ãô½İ|8000","ÉúÃü|80000"}
ImageTable.Attribute[100972] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100973] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100974] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100975] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100976] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100977] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100984] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100985] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100986] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100987] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100988] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100989] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105676] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105677] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105678] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105679] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105680] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105681] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100978] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100979] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100980] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100981] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100982] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100983] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100967] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100968] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100969] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100970] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100971] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100800] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100801] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100802] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100803] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100804] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100805] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100930] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100931] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100932] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100933] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100934] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100935] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100600] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100601] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100602] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100603] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100604] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100605] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[101801] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[100896] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105994] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[119500] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[119502] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105688] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105689] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105690] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105691] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105692] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105693] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105731] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105732] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105733] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105734] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105735] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[105736] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[106425] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[106426] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[106427] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[106428] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[106429] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[106430] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[109426] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[119306] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[119307] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[119308] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[119309] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[119310] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
ImageTable.Attribute[119311] = {"¹¥»÷|200000","·ÀÓù|16000","Ãô½İ|16000","ÉúÃü|200000"}
---³èÎï
ImageTable.Attribute[117020] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[101402] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[110379] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[110308] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[106478] = {"¹¥»÷|5000","·ÀÓù|1200","Ãô½İ|1200","ÉúÃü|5000"}
ImageTable.Attribute[117858] = {"¹¥»÷|5000","·ÀÓù|1200","Ãô½İ|1200","ÉúÃü|5000"}
ImageTable.Attribute[104875] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[104892] = {"¹¥»÷|3000","·ÀÓù|1000","Ãô½İ|1000","ÉúÃü|3000"}
ImageTable.Attribute[110850] = {"¹¥»÷|7000","·ÀÓù|1500","Ãô½İ|1500","ÉúÃü|7000"}
ImageTable.Attribute[119612] = {"¹¥»÷|10000","·ÀÓù|1800","Ãô½İ|1800","ÉúÃü|10000"}
ImageTable.Attribute[100859] = {"¹¥»÷|20000","·ÀÓù|3600","Ãô½İ|3600","ÉúÃü|20000"}
ImageTable.Attribute[109427] = {"¹¥»÷|20000","·ÀÓù|3600","Ãô½İ|3600","ÉúÃü|20000"}
ImageTable.Attribute[104886] = {"¹¥»÷|20000","·ÀÓù|3600","Ãô½İ|3600","ÉúÃü|20000"}
ImageTable.Attribute[101930] = {"¹¥»÷|20000","·ÀÓù|3600","Ãô½İ|3600","ÉúÃü|20000"}
ImageTable.Attribute[101922] = {"¹¥»÷|20000","·ÀÓù|3600","Ãô½İ|3600","ÉúÃü|20000"}
ImageTable.Attribute[100898] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[100897] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[100625] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[119501] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[101800] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[107102] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[117122] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[117016] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[117017] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[107904] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}
ImageTable.Attribute[108083] = {"¹¥»÷|100000","·ÀÓù|100000","Ãô½İ|100000","ÉúÃü|100000"}

ImageTable.T = {} -- ÉèÖÃ³èÎïĞÎÏóÌáÈ¡ºóµÄ¸øÓëµÀ¾ßµÄ id ÊıÁ¿
ImageTable.T[117020] = {80630,1}
ImageTable.T[101402] = {80635,1}
ImageTable.T[110379] = {80636,1}
ImageTable.T[110308] = {80637,1}
ImageTable.T[106478] = {80711,1}
ImageTable.T[117858] = {80712,1}
ImageTable.T[104875] = {80927,1}
ImageTable.T[104892] = {80928,1}
ImageTable.T[110850] = {80929,1}
ImageTable.T[119612] = {80930,1}
ImageTable.T[100859] = {81030,1}
ImageTable.T[109427] = {81031,1}
ImageTable.T[104886] = {81032,1}
ImageTable.T[101930] = {81069,1}
ImageTable.T[101922] = {81070,1}
ImageTable.T[100898] = {81103,1}
ImageTable.T[100897] = {81104,1}
ImageTable.T[105993] = {81105,1}
ImageTable.T[100625] = {81106,1}

ImageTable.CT = {}-- ÉèÖÃÈËÎïĞÎÏóÌáÈ¡ºóµÄ¸øÓëµÀ¾ßµÄ id ÊıÁ¿


