 
-- 形象
-- 本脚本 
--[[
说明: 
	形象 形象编号（如果 多个武器 或颜色 只需填写第一编号即可）
	武器 这个形象拥有的武器数量 （单一形象 填写1）
	颜色 拥有的颜色数量 （单一形象 填写1）
	本脚本会自动根据 武器和颜色 自动排列形象编号，避免繁琐的操作。
	注意：多武器 颜色 必须 形象编号连续 否则会出现bug
	注意：多武器 颜色 必须 形象编号连续 否则会出现bug
	注意：多武器 颜色 必须 形象编号连续 否则会出现bug
--]]

ImageTable = {}

ImageTable.proportion = 1   -- 比例衣橱内为使用的形象增加的比例


ImageTable.Char = {   -- 人物形象
    -- GM形象
    {形象 = 100450, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100450, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100475, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100500, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105712, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},

    --白色形象
    {形象 = 100972, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100978, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100984, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100990, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105700, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},

    --黑灰形象
    {形象 = 100537, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100631, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100768, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100774, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105206, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105218, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105224, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105442, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105460, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105466, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},

    {形象 = 100888, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105973, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 108151, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100575, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100650, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100924, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 105979, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100600, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100942, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100700, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},

    --精灵形象
    {形象 = 110350, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 110356, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 110362, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 110368, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},

    --彩色
    --106708 106706 106707 108312
    --100187 100543 100792 100909 105478 105676
    --105955 106192 106186 106224 106241 106706 106793 119330
                             --4
    {形象 = 110368, 武器 = 6, 颜色 = 1 ,Item = {29999,1}},

    --石器

    {形象 = 100860, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100858, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100859, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100861, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100864, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100865, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100866, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100867, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 100870, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    {形象 = 116022, 武器 = 1, 颜色 = 1 ,Item = {29999,1}},
    --特殊
    --100199 100921 100936 105993 105994
}

ImageTable.Pet = {   -- 宠物形象
    --{形象 = 117020, 颜色 = 1 ,Item = {29999,1}},
}


ImageTable.Attribute = {}

----人物

ImageTable.Attribute[100200] = {"攻击|50","防御|50","敏捷|50","生命|50"}
---宠物
--ImageTable.Attribute[117020] = {"攻击|50","防御|50","敏捷|50","生命|50"}

ImageTable.T = {} -- 设置宠物形象提取后的给与道具的 id 数量
--ImageTable.T[117020] = {29999, 1}

ImageTable.CT = {}-- 设置人物形象提取后的给与道具的 id 数量
--ImageTable.T[104843] = {29999, 1}

