

-------------------------------------------------------------------------------------
----------------------------自动战斗辅助系统-----------------------------------------
-------------------------------------------------------------------------------------
-- 创意：YH
-- 界面：凤凰
-- 编写：无语

zdzd_SetComSkill ={}
zdzd_SetComSkill.Bug = {7,13,14,15,16,17,18,50,51,52,53,54,69,70,71,96,98,99,100,101,102,103,104,105,106,107,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,250,251,252,253,254,255,256,2004,260} -- 不能战斗使用的技能
zdzd_SetComSkill.zj = {8,10,11,12,55,56,57,58,59,60,61,64,67,1005} --对只能对自己使用的技能 例如明镜 反击
zdzd_SetComSkill.dy = {68} --可以对队友使用的技能且不能对敌方和自己使用 例如气绝 护卫

zdzd_SetComSkill.MeStrong = {62,65} -- 对我方使用的强力技能
zdzd_SetComSkill.EnemyStrong = {23,24,25,26,38,39,40,41,42,43,}-- 对敌方使用的强力技能
zdzd_SetComSkill.MeSuper = {63,66,67,802,572,574}   -- 对我方使用的超强技能
zdzd_SetComSkill.EnemySuper = {27,28,29,30,44,45,46,47,48,49,195,570,805}-- 对敌方使用的超强技能



zdzd_SetComSkill.WaitingTime = 90   -- 每回合出手等待时间（60 等于1秒） 注：此项很重要 根据自己服务器配置 调节 适合自己的速度
zdzd_SetComSkill.zdsitu = {1,100}  -- 是否开启原地走路 1开启 0 关闭 ，间隔时间（60 等于1秒）  
-----------------------反挂设置---------------
zdzd_SetComSkill.speed_production = 1   --反高速制作  1 开启， 0 关闭 (注意：开启后 刻印技能无法使用了)
zdzd_SetComSkill.speed_fighting = 1    -- 反高速战斗
zdzd_SetComSkill.speed_fighting_tolerate = 3 -- 反高速容忍  数值越大 越降低误封的可能性 （推荐 3）
zdzd_SetComSkill.validation = 0 -- npc 对话验证码   0 关闭 其他为时间间隔 分钟


zdzd_SetComSkill.CombatValidation = 0  -- 是否开启战斗验证码
zdzd_SetComSkill.MPHP = {0.05,0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.75,0.80} -- 血魔池注入比例 必须10个内容 一次对应10个等级的料理血瓶 
zdzd_SetComSkill.Msg = {
"$7点击补充血魔池",
"会自动将包裹内的料理血瓶转换为血魔",
"10级                "..(zdzd_SetComSkill.MPHP[10]*100).."%",
"9 级                "..(zdzd_SetComSkill.MPHP[9]*100).."%",
"8 级                "..(zdzd_SetComSkill.MPHP[8]*100).."%",
"7 级                "..(zdzd_SetComSkill.MPHP[7]*100).."%",
"6 级                "..(zdzd_SetComSkill.MPHP[6]*100).."%",
"5 级                "..(zdzd_SetComSkill.MPHP[5]*100).."%",
"4 级                "..(zdzd_SetComSkill.MPHP[4]*100).."%",
"3 级                "..(zdzd_SetComSkill.MPHP[3]*100).."%",	
"2 级                "..(zdzd_SetComSkill.MPHP[2]*100).."%",	
"1 级                "..(zdzd_SetComSkill.MPHP[1]*100).."%",	
}

zdzd_SetComSkill.ldb = "158471323" -- 独家验证码 必须设置 用于防止玩家删除Ldb 文件启动游戏


------------------------------------------------------
zdzd_SetComSkill.accelerating = 2  -- 战斗加速倍率 当 设置为1时 为没有任何加速战斗效果并且 反加速战斗生效 其他值 为加速比例 例如 2 为战斗加速2倍
------------------------------------------------------







