


--------------说明------------
--[[

图鉴坐骑 最大支持100种 图鉴设定

双击道具既可以 添加相应的图鉴坐骑


窗口命令: [zuoqi2]

调用函数: zuoqi2TalkEventA(_PlayerIndex, "[zuoqi2]")


道具说明： 
特殊类别 填写对应的 图鉴编号

？	坐骑图鉴卡				LUA_useMount						804030	26030		26		0	1	0	0	1	1	1	4	0	0	0			0	0	0	0	0	0																																															19							0	0	1			0			100	0	0			0



1防御 
2攻击 
3敏捷 

4精神 
5回复 

6生命 
7魔法 
8魔攻 
9魔抗 

抗毒 
抗睡 
抗石 
抗醉 
抗混 
抗遗 


必杀 
反击 
命中 
闪躲 

移动速度

]]

-----------------------------------------
zuoqi2 = {}

zuoqi2[1] = {101000,"虎人","攻击|999","防御|999","敏捷|123","移动速度|120","攻击|999","防御|999","敏捷|123","移动速度|120"}




-----------------------------------------------------------









