


--------------说明------------
--[[

图鉴坐骑 最大支持100种 图鉴设定

双击道具既可以 添加相应的图鉴坐骑


窗口命令: [zuoqi2]

调用函数: zuoqi2TalkEventA(_PlayerIndex, "[zuoqi2]")


道具说明： 
特殊类别 填写对应的 图鉴编号

？	坐骑图鉴卡				LUA_useMount						804030	26030		26		0	1	0	0	1	1	1	4	0	0	0			0	0	0	0	0	0																																															19							0	0	1			0			100	0	0			0



1防御 
2攻击 
3敏捷 

4精神 
5回复 

6生命 
7魔法 
8魔攻 
9魔抗 

抗毒 
抗睡 
抗石 
抗醉 
抗混 
抗遗 


必杀 
反击 
命中 
闪躲 

移动速度

]]

-----------------------------------------
zuoqi2 = {}

zuoqi2[1] = {104589,"小黄车", "移动速度|120"}
zuoqi2[2] = {120088,"幽灵狼", "移动速度|130"}
zuoqi2[3] = {104620,"五彩神牛", "移动速度|140"}
zuoqi2[4] = {120090,"暗夜魔龙", "移动速度|150"}
zuoqi2[5] = {104954,"黄金狮子", "移动速度|160"}
zuoqi2[6] = {104881,"傲血凤凰", "移动速度|170"}
zuoqi2[7] = {104721,"嗜命神龙", "移动速度|180"}


-----------------------------------------------------------









